[
		{
			"name": "Acolyte",
			"source": "PHB",
			"page": 127,
			"skillProficiencies": "Insight, Religion",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Insight, Religion"
					]
				},
				{
					"name": "Languages",
					"type": "entries",
					"entries": [
						"Two of your choice"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A holy symbol (a gift to you when you entered the priesthood), a prayer book or prayer wheel, 5 sticks of incense, vestments, a set of common clothes, and a belt pouch containing 15 gp"
					]
				},
				{
					"name": "Feature: Shelter of the Faithful",
					"type": "entries",
					"entries": [
						"As an acolyte, you command the respect of those who share your faith, and you can perform the religious ceremonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle.",
						"You might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home. While near your temple, you can call upon the priests for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple."
					],
					"data": {
						"isFeature": true
					}
				}
			]
		},
		{
			"name": "Charlatan",
			"source": "PHB",
			"page": 128,
			"skillProficiencies": "Deception, Sleight of Hand",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Deception, Sleight of Hand"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"Disguise Kit, Forgery Kit"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A set of fine clothes, a disguise kit, tools of the con of your choice (ten stoppered bottles filled with colored liquid, a set of weighted dice, a deck of marked cards, or a signet ring of an imaginary duke), and a belt pouch containing 15 gp"
					]
				},
				{
					"name": "Feature: False Identity",
					"type": "entries",
					"entries": [
						"You have created a second identity that includes documentation, established acquaintances, and disguises that allow you to assume that persona. Additionally, you can forge documents including official papers and personal letters, as long as you have seen an example of the kind of document or the handwriting you are trying to copy."
					],
					"data": {
						"isFeature": true
					}
				},
				{
					"name": "Favorite Schemes",
					"type": "entries",
					"entries": [
						"Every charlatan has an angle he or she uses in preference to other schemes. Choose a favorite scam or roll on the table below.",
						{
							"type": "table",
							"colLabels": [
								"d6",
								"Scam"
							],
							"colStyles": [
								"col-xs-1 text-align-center",
								"col-xs-11"
							],
							"rows": [
								[
									"1",
									"I cheat at games of chance."
								],
								[
									"2",
									"I shave coins or forge documents."
								],
								[
									"3",
									"I insinuate myself into people's lives to prey on their weakness and secure their fortunes."
								],
								[
									"4",
									"I put on new identities like clothes."
								],
								[
									"5",
									"I run sleight-of-hand cons on street corners."
								],
								[
									"6",
									"I convince people that worthless junk is worth their hard-earned money."
								]
							]
						}
					]
				}
			]
		},
		{
			"name": "Criminal",
			"source": "PHB",
			"page": 129,
			"skillProficiencies": "Deception, Stealth",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Deception, Stealth"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"One type of gaming set, thieves' tools"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A crowbar, a set of dark common clothes including a hood, and a belt pouch containing 15 gp"
					]
				},
				{
					"name": "Feature: Criminal Contact",
					"type": "entries",
					"entries": [
						"You have a reliable and trustworthy contact who acts as your liaison to a network of other criminals. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."
					],
					"data": {
						"isFeature": true
					}
				},
				{
					"name": "Specialty",
					"type": "entries",
					"entries": [
						"There are many kinds of criminals, and within a thieves' guild or similar criminal organization, individual members have particular specialties. Even criminals who operate outside of such organizations have strong preferences for certain kinds of crimes over others. Choose the role you played in your criminal life, or roll on the table below.",
						{
							"type": "table",
							"colLabels": [
									"d8",
									"Specialty"
							],
							"colStyles": [
									"col-xs-1 text-align-center",
									"col-xs-11"
							],
							"rows": [
								[
									"1",
									"Blackmailer"
								],
								[
									"2",
									"Burglar"
								],
								[
									"3",
									"Enforcer"
								],
								[
									"4",
									"Fence"
								],
								[
									"5",
									"Highway robber"
								],
								[
									"6",
									"Hired killer"
								],
								[
									"7",
									"Pickpocket"
								],
								[
									"8",
									"Smuggler"
								]
							]
						}
					]
				}
			]
		},
		{
			"name": "Entertainer",
			"source": "PHB",
			"page": 130,
			"skillProficiencies": "Acrobatics, Performance",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Acrobatics, Performance"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"Disguise kit, one type of musical instrument"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A musical instrument (one of your choice), the favor of an admirer (love letter, lock of hair, or trinket), a costume, and a belt pouch containing 15 gp"
					]
				},
				{
					"name": "Feature: By Popular Demand",
					"type": "entries",
					"entries": [
						"You can always find a place to perform, usually in an inn or tavern but possibly with a circus, at a theater, or even in a noble's court. At such a place, you receive free lodging and food of a modest or comfortable standard (depending on the quality of the establishment), as long as you perform each night. In addition, your performance makes you something of a local figure. When strangers recognize you in a town where you have performed, they typically take a liking to you."
					],
					"data": {
						"isFeature": true
					}
				},
				{
					"name": "Specialty",
					"type": "entries",
					"entries": [
						"A good entertainer is versatile, spicing up every performance with a variety of different routines. Choose one to three routines or roll on the table below to define your expertise as an entertainer.",
						{
							"type": "table",
							"colLabels": [
									"d10",
									"Routines"
							],
							"colStyles": [
									"col-xs-1 text-align-center",
									"col-xs-11"
							],
							"rows": [
								[
									"1",
									"Actor"
								],
								[
									"2",
									"Dancer"
								],
								[
									"3",
									"Fire-eater"
								],
								[
									"4",
									"Jester"
								],
								[
									"5",
									"Juggler"
								],
								[
									"6",
									"Instrumentalist"
								],
								[
									"7",
									"Poet"
								],
								[
									"8",
									"Singer"
								],
								[
									"9",
									"Storyteller"
								],
								[
									"10",
									"Tumbler"
								]
							]
						}
					]
				}
			]
		},
		{
			"name": "Folk Hero",
			"source": "PHB",
			"page": 131,
			"skillProficiencies": "Animal Handling, Survival",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Animal Handling, Survival"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"One type of artisan's tools, vehicles (land)"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A set of artisan's tools (one of your choice), a shovel, an iron pot, a set of common clothes, and a belt pouch containing 10 gp"
					]
				},
				{
					"name": "Feature: Rustic Hospitality",
					"type": "entries",
					"entries": [
						"Since you come from the ranks of the common folk, you fit in among them with ease. You can find a place to hide, rest, or recuperate among other commoners, unless you have shown yourself to be a danger to them. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you."
					],
					"data": {
						"isFeature": true
					}
				},
				{
					"name": "Specialty",
					"type": "entries",
					"entries": [
						"You previously pursued a simple profession among the peasantry, perhaps as a farmer, miner, servant, shepherd, woodcutter, or gravedigger. But something happened that set you on a different path and marked you for greater things. Choose or randomly determine a defining event that marked you as a hero of the people.",
						{
							"type": "table",
							"colLabels": [
									"d10",
									"Defining Event"
							],
							"colStyles": [
									"col-xs-1 text-align-center",
									"col-xs-11"
							],
							"rows": [
								[
									"1",
									"I stood up to a tyrant's agents."
								],
								[
									"2",
									"I saved people during a natural disaster."
								],
								[
									"3",
									"I stood alone against a terrible monster."
								],
								[
									"4",
									"I stole from a corrupt merchant to help the poor."
								],
								[
									"5",
									"I led a militia to fight of an invading army."
								],
								[
									"6",
									"I broke into a tyrant's castle and stole weapons to arm the people."
								],
								[
									"7",
									"I trained the peasantry to use farming implements as weapons against a tyrant's soldiers."
								],
								[
									"8",
									"A lord rescinded an unpopular decree after I led a symbolic act of protest against it."
								],
								[
									"9",
									"A celestial, fey, or similar creature gave me a blessing or revealed my secret origin."
								],
								[
									"10",
									"Recruited into a lord's army, I rose to leadership and was commended for my heroism."
								]
							]
						}
					]
				}
			]
		},
		{
			"name": "Guild Artisan",
			"source": "PHB",
			"page": 132,
			"skillProficiencies": "Insight, Persuasion",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Insight, Persuasion"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"One type of artisan's tools"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A set of artisan's tools (one of your choice), a letter of introduction from your guild, a set of traveler's clothes, and a belt pouch containing 15 gp"
					]
				},
				{
					"name": "Feature: Guild Membership",
					"type": "entries",
					"entries": [
						"As an established and respected member of a guild, you can rely on certain benefits that membership provides. Your fellow guild members will provide you with lodging and food if necessary, and pay for your funeral if needed. In some cities and towns, a guildhall offers a central place to meet other members of your profession, which can be a good place to meet potential patrons, allies, or hirelings.",
						"Guilds often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. Such connections might require the donation of money or magic items to the guild's coffers.",
						"You must pay dues of 5 gp per month to the guild. If you miss payments, you must make up back dues to remain in the guild's good graces."
					],
					"data": {
						"isFeature": true
					}
				},
				{
					"name": "Specialty",
					"type": "entries",
					"entries": [
						"Guilds are generally found in cities large enough to support several artisans practicing the same trade. However, your guild might instead be a loose network of artisans who each work in a different village within a larger realm. Work with your DM to determine the nature of your guild. You can select your guild business from the Guild Business table or roll randomly.",
						{
							"type": "table",
							"colLabels": [
									"d20",
									"Guild Business"
							],
							"colStyles": [
									"col-xs-1 text-align-center",
									"col-xs-11"
							],
							"rows": [
								[
									"1",
									"Alchemists and apothecaries"
								],
								[
									"2",
									"Armorers, locksmiths, and finesmiths"
								],
								[
									"3",
									"Brewers, distillers, and vintners"
								],
								[
									"4",
									"Calligraphers, scribes, and scriveners"
								],
								[
									"5",
									"Carpenters, roofers, and plasterers"
								],
								[
									"6",
									"Cartographers, surveyors, and chart-makers"
								],
								[
									"7",
									"Cobblers and shoemakers"
								],
								[
									"8",
									"Cooks and bakers"
								],
								[
									"9",
									"Glassblowers and glaziers"
								],
								[
									"10",
									"Jewelers and gemcutters"
								],
								[
									"11",
									"Leatherworkers, skinners, and tanners"
								],
								[
									"12",
									"Masons and stonecutters"
								],
								[
									"13",
									"Painters, limners, and sign-makers"
								],
								[
									"14",
									"Potters and tile-makers"
								],
								[
									"15",
									"Shipwrights and sail-makers"
								],
								[
									"16",
									"Smiths and metal-forgers"
								],
								[
									"17",
									"Tinkers, pewterers, and casters"
								],
								[
									"18",
									"Wagon-makers and wheelwrights"
								],
								[
									"19",
									"Weavers and dyers"
								],
								[
									"20",
									"Woodcarvers, coopers, and bowyers"
								]
							]
						}
					]
				}
			]
		},
		{
			"name": "Hermit",
			"source": "PHB",
			"page": 134,
			"skillProficiencies": "Medicine, Religion",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Medicine, Religion"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"Herbalism Kit"
					]
				},
				{
					"name": "Languages",
					"type": "entries",
					"entries": [
						"One of your choice"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A scroll case stuffed full of notes from your studies or prayers, a winter blanket, a set of common clothes, an herbalism kit, and 5 gp"
					]
				},
				{
					"name": "Feature: Discovery",
					"type": "entries",
					"entries": [
						"The quiet seclusion of your extended hermitage gave you access to a unique and powerful discovery. The exact nature of this revelation depends on the nature of your seclusion. It might be a great truth about the cosmos, the deities, the powerful beings of the outer planes, or the forces of nature. It could be a site that no one else has ever seen. You might have uncovered a fact that has long been forgotten, or unearthed some relic of the past that could rewrite history. It might be information that would be damaging to the people who or consigned you to exile, and hence the reason for your return to society.",
						"Work with your DM to determine the details of your discovery and its impact on the campaign."
					],
					"data": {
						"isFeature": true
					}
				},
				{
					"name": "Specialty",
					"type": "entries",
					"entries": [
						"What was the reason for your isolation, and what changed to allow you to end your solitude? You can work with your DM to determine the exact nature of your seclusion, or you can choose or roll on the table below to determine the reason behind your seclusion.",
						{
							"type": "table",
							"colLabels": [
									"d8",
									"Life of Seclusion"
							],
							"colStyles": [
									"col-xs-1 text-align-center",
									"col-xs-11"
							],
							"rows": [
								[
									"1",
									"I was searching for spiritual enlightenment."
								],
								[
									"2",
									"I was partaking of communal living in accordance with the dictates of a religious order."
								],
								[
									"3",
									"I was exiled for a crime I didn't commit."
								],
								[
									"4",
									"I retreated from society after a life-altering event."
								],
								[
									"5",
									"I needed a quiet place to work on my art, literature, music, or manifesto."
								],
								[
									"6",
									"I needed to commune with nature, far from civilization."
								],
								[
									"7",
									"I was the caretaker of an ancient ruin or relic."
								],
								[
									"8",
									"I was a pilgrim in search of a person, place, or relic of spiritual significance."
								]
							]
						}
					]
				}
			]
		},
		{
			"name": "Noble",
			"source": "PHB",
			"page": 135,
			"skillProficiencies": "History, Persuasion",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"History, Persuasion"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"One type of gaming set"
					]
				},
				{
					"name": "Languages",
					"type": "entries",
					"entries": [
						"One of your choice"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A set of fine clothes, a signet ring, a scroll of pedigree, and a purse containing 25 gp"
					]
				},
				{
					"name": "Feature: Position of Privilege",
					"type": "entries",
					"entries": [
						"Thanks to your noble birth, people are inclined to think the best of you. You are welcome in high society, and people assume you have the right to be wherever you are. The common folk make every effort to accommodate you and avoid your displeasure, and other people of high birth treat you as a member of the same social sphere. You can secure an audience with a local noble if you need to."
					],
					"data": {
						"isFeature": true
					}
				}
			]
		},
		{
			"name": "Outlander",
			"source": "PHB",
			"page": 136,
			"skillProficiencies": "Athletics, Survival",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Athletics, Survival"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"One type of musical instrument"
					]
				},
				{
					"name": "Languages",
					"type": "entries",
					"entries": [
						"One of your choice"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A staff, a hunting trap, a trophy from an animal you killed, a set of traveler's clothes, and a belt pouch containing 10 gp"
					]
				},
				{
					"name": "Feature: Wanderer",
					"type": "entries",
					"entries": [
						"You have an excellent memory for maps and geography, and you can always recall the general layout of terrain, settlements, and other features around you. In addition, you can find food and fresh water for yourself and up to five other people each day, provided that the land offers berries, small game, water, and so forth."
					],
					"data": {
						"isFeature": true
					}
				},
				{
					"name": "Specialty",
					"type": "entries",
					"entries": [
						"You've been to strange places and seen things that others cannot begin to fathom. Consider some of the distant lands you have visited, and how they impacted you. You can roll on the following table to determine your occupation during your time in the wild, or choose one that best fits your character.",
						{
							"type": "table",
							"colLabels": [
									"d10",
									"Origin"
							],
							"colStyles": [
									"col-xs-1 text-align-center",
									"col-xs-11"
							],
							"rows": [
								[
									"1",
									"Forester"
								],
								[
									"2",
									"Trapper"
								],
								[
									"3",
									"Homesteader"
								],
								[
									"4",
									"Guide"
								],
								[
									"5",
									"Exile or outcast"
								],
								[
									"6",
									"Bounty hunter"
								],
								[
									"7",
									"Pilgrim"
								],
								[
									"8",
									"Tribal nomad"
								],
								[
									"9",
									"Hunter-gatherer"
								],
								[
									"10",
									"Tribal marauder"
								]
							]
						}
					]
				}
			]
		},
		{
			"name": "Sage",
			"source": "PHB",
			"page": 137,
			"skillProficiencies": "Arcana, History",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Arcana, History"
					]
				},
				{
					"name": "Languages",
					"type": "entries",
					"entries": [
						"Two of your choice"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A bottle of black ink, a quill, a small knife, a letter from a dead colleague posing a question you have not yet been able to answer, a set of common clothes, and a belt pouch containing 10 gp"
					]
				},
				{
					"name": "Feature: Researcher",
					"type": "entries",
					"entries": [
						"When you attempt to learn or recall a piece of lore, if you do not know that information, you often know where and from whom you can obtain it. Usually, this information comes from a library, scriptorium, university, or a sage or other learned person or creature, Your DM might rule that the knowledge you seek is secreted away in an almost inaccessible place, or that it simply cannot be found. Unearthing the deepest secrets of the multiverse can require an adventure or even a whole campaign."
					],
					"data": {
						"isFeature": true
					}
				},
				{
					"name": "Specialty",
					"type": "entries",
					"entries": [
						"To determine the nature of your scholarly training, roll a d8 or choose from the options in the table below.",
						{
							"type": "table",
							"colLabels": [
									"d8",
									"Field of Study"
							],
							"colStyles": [
									"col-xs-1 text-align-center",
									"col-xs-11"
							],
							"rows": [
								[
									"1",
									"Alchemist"
								],
								[
									"2",
									"Astronomer"
								],
								[
									"3",
									"Discredited academic"
								],
								[
									"4",
									"Librarian"
								],
								[
									"5",
									"Professor"
								],
								[
									"6",
									"Researcher"
								],
								[
									"7",
									"Wizard's apprentice"
								],
								[
									"8",
									"Scribe"
								]
							]
						}
					]
				}
			]
		},
		{
			"name": "Sailor",
			"source": "PHB",
			"page": 139,
			"skillProficiencies": "Athletics, Perception",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Athletics, Perception"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"Navigator's tools, vehicles (water)"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A belaying pin (club), 50 feet of silk rope, a lucky charm such as a rabbit foot or a small stone with a hole in the center (or you may roll for a random trinket on the Trinkets table in chapter 5), a set of common clothes, and a belt pouch containing 10 gp"
					]
				},
				{
					"name": "Feature: Ship's Passage",
					"type": "entries",
					"entries": [
						"When you need to, you can secure free passage on a sailing ship for yourself and your adventuring companions. You might sail on the ship you served on, or another ship you have good relations with (perhaps one captained by a former crewmate). Because you're calling in a favor, you can't be certain of a schedule or route that will meet your every need. Your Dungeon Master will determine how long it takes to get where you need to go. In return for your free passage, you and your companions are expected to assist the crew during the voyage."
					],
					"data": {
						"isFeature": true
					}
				}
			]
		},
		{
			"name": "Soldier",
			"source": "PHB",
			"page": 140,
			"skillProficiencies": "Athletics, Intimidation",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Athletics, Intimidation"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"One type of gaming set, vehicles (land)"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"An insignia of rank, a trophy taken from a fallen enemy (a dagger, broken blade, or piece of a banner), a set of bone dice or deck of cards, a set of common clothes, and a belt pouch containing 10 gp"
					]
				},
				{
					"name": "Feature: Military Rank",
					"type": "entries",
					"entries": [
						"You have a military rank from your career as a soldier. Soldiers loyal to your former military organization still recognize your authority and influence, and they defer to you if they are of a lower rank. You can invoke your rank to exert influence over other soldiers and requisition simple equipment or horses for temporary use. You can also usually gain access to friendly military encampments and fortresses where your rank is recognized."
					],
					"data": {
						"isFeature": true
					}
				},
				{
					"name": "Specialty",
					"type": "entries",
					"entries": [
						"During your time as a soldier, you had a specific role to play in your unit or army. Roll a d8 or choose from the options in the table below to determine your role:",
						{
							"type": "table",
							"colLabels": [
									"d8",
									"Role"
							],
							"colStyles": [
									"col-xs-1 text-align-center",
									"col-xs-11"
							],
							"rows": [
								[
									"1",
									"Officer"
								],
								[
									"2",
									"Scout"
								],
								[
									"3",
									"Infantry"
								],
								[
									"4",
									"Cavalry"
								],
								[
									"5",
									"Healer"
								],
								[
									"6",
									"Quartermaster"
								],
								[
									"7",
									"Standard-bearer"
								],
								[
									"8",
									"Support staff (cook, blacksmith, or the like)"
								]
							]
						}
					]
				}
			]
		},
		{
			"name": "Urchin",
			"source": "PHB",
			"page": 141,
			"skillProficiencies": "Sleight of Hand, Stealth",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Sleight of Hand, Stealth"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"Disguise Kit, thieves' tools"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A small knife, a map of the city you grew up in, a pet mouse, a token to remember your parents by, a set of common clothes, and a belt pouch containing 10 gp"
					]
				},
				{
					"name": "Feature: City Secrets",
					"type": "entries",
					"entries": [
						"You know the secret patterns and flow to cities and can find passages through the urban sprawl that others would miss. When you are not in combat, you (and companions you lead) can travel between any two locations in the city twice as fast as your speed would normally allow."
					],
					"data": {
						"isFeature": true
					}
				}
			]
		},
		{
			"name": "Variant Criminal (Spy)",
			"source": "PHB",
			"page": 130,
			"skillProficiencies": "Deception, Stealth",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Deception, Stealth"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"One type of gaming set, thief's tools"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A crowbar, a set of dark common clothes including a hood, and a belt pouch containing 15 gp"
					]
				},
				{
					"name": "Feature: Spy Contact",
					"type": "entries",
					"entries": [
						"You have a reliable and trustworthy contact who acts as your liaison to a network of other spies. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."
					],
					"data": {
						"isFeature": true
					}
				}
			]
		},
		{
			"name": "Variant Entertainer (Gladiator)",
			"source": "PHB",
			"page": 131,
			"skillProficiencies": "Acrobatics, Performance",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Acrobatics, Performance"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"Disguise kit, one type of musical instrument"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"An inexpensive but unusual weapon, such as a trident or net (one of your choice), the favor of an admirer (love letter, lock of hair, or trinket), a costume, and a belt pouch containing 15 gp"
					]
				},
				{
					"name": "Feature: By Popular Demand",
					"type": "entries",
					"entries": [
						"You can find a place to perform in any place that features combat for entertainment-perhaps a gladiatorial arena or secret pit fighting club. In such an area, you receive free lodging and food of a modest or comfortable standard (depending on the quality of the establishment), as long as you perform each night. In addition, your performance makes you something of a local figure. When strangers recognize you in a town where you have performed, they typically take a liking to you."
					],
					"data": {
						"isFeature": true
					}
				}
			]
		},
		{
			"name": "Variant Guild Artisan (Guild Merchant)",
			"source": "PHB",
			"page": 133,
			"skillProficiencies": "Insight, Persuasion",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Insight, Persuasion"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"Navigator's Tools or an additional language"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A mule and cart, a letter of introduction from your guild, a set of traveler's clothes, and a belt pouch containing 15 gp"
					]
				},
				{
					"name": "Feature: Guild Membership",
					"type": "entries",
					"entries": [
						"As an established and respected member of a guild or large merchant consortium, you can rely on certain benefits that membership provides. Your fellow guild members will provide you with lodging and food if necessary, and pay for your funeral if needed. In some cities and towns, a guildhall offers a central place to meet other members of your profession, which can be a good place to meet potential patrons, allies, or hirelings.",
						"Guilds or consortiums often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. Such connections might require the donation of money or magic items to the guild's coffers.",
						"You must pay dues of 5 gp per month to the guild. If you miss payments, you must make up back dues to remain in the guild's good graces."
					],
					"data": {
						"isFeature": true
					}
				}
			]
		},
		{
			"name": "Variant Noble (Knight)",
			"source": "PHB",
			"page": 136,
			"skillProficiencies": "History, Persuasion",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"History, Persuasion"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"One type of gaming set"
					]
				},
				{
					"name": "Languages",
					"type": "entries",
					"entries": [
						"One of your choice"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A banner or other token from a noble lord or lady to whom you have given your heart, a set of fine clothes, a signet ring, a scroll of pedigree, and a purse containing 25 gp"
					]
				},
				{
					"name": "Variant Noble (Knight)",
					"type": "entries",
					"entries": [
						"A knighthood is among the lowest noble titles in most societies, but it can be a path to higher status. If you wish to be a knight, choose the Retainers feature instead of the Position of Privilege feature.",
						"As an emblem of chivalry and the ideals of courtly love, you might include among your equipment a banner or other token from a noble lord or lady to whom you have given your heart-in a chaste sort of devotion."
					]
				},
				{
					"name": "Feature: Retainers",
					"type": "entries",
					"entries": [
						"You have the service of three retainers loyal to your family. These retainers can be attendants or messengers, and one might be a majordomo. <b>One of your retainers is a noble who serves as your squire, aiding you in exchange for training on his or her own path to knighthood </b> (This person could be your bond.). Your two remaining retainers might include a groom to care for your horse and a servant who polishes your armor (and even helps you put it on).",
						"Your retainers can perform mundane tasks for you, but they do not fight for you, will not follow you into obviously dangerous areas (such as dungeons), and will leave if they are frequently endangered or abused."
					],
					"data": {
						"isFeature": true
					}
				}
			]
		},
		{
			"name": "Variant Sailor (Pirate)",
			"source": "PHB",
			"page": 139,
			"skillProficiencies": "Athletics, Perception",
			"entries": [
				{
					"name": "Skill Proficiencies",
					"type": "entries",
					"entries": [
						"Athletics, Perception"
					]
				},
				{
					"name": "Tool Proficiencies",
					"type": "entries",
					"entries": [
						"Navigator's tools, vehicles (water)"
					]
				},
				{
					"name": "Equipment",
					"type": "entries",
					"entries": [
						"A belaying pin (club), 50 feet of silk rope, a lucky charm such as a rabbit foot or a small stone with a hole in the center (or you may roll for a random trinket on the Trinkets table in chapter 5), a set of common clothes, and a belt pouch containing 10 gp"
					]
				},
				{
					"name": "Feature: Bad Reputation",
					"type": "entries",
					"entries": [
						"No matter where you go, people are afraid of you due to your reputation. When you are in a civilized settlement, you can get away with minor criminal offenses, such as refusing to pay for food at a tavern or breaking down doors at a local shop, since most people will not report your activity to the authorities."
					],
					"data": {
						"isFeature": true
					}
				}
			]
		}
	]
