[
	{
		"name": "Barbarian",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 12
		},
		"proficiency": [
			"str",
			"con"
		],
		"startingProficiencies": {
			"armor": [
				"light",
				"medium",
				"shields"
			],
			"weapons": [
				"simple",
				"martial"
			],
			"skills": {
				"choose": 2,
				"from": [
					"Animal Handling",
					"Athletics",
					"Intimidation",
					"Nature",
					"Perception",
					"Survival"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a greataxe or (b) any martial melee weapon",
				"(a) two handaxes or (b) any simple weapon",
				"An explorer's pack, and four javelins"
			],
			"goldAlternative": "2d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Rage",
					"entries": [
						"In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.",
						"While raging, you gain the following benefits if you aren't wearing heavy armor:",
						{
							"type": "list",
							"items": [
								"You have advantage on Strength checks and Strength saving throws.",
								"When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. This bonus increases as you level.",
								"You have resistance to bludgeoning, piercing, and slashing damage."
							]
						},
						"If you are able to cast spells, you can't cast them or concentrate on them while raging.",
						"Your rage lasts for 1 minute. It ends early if you are knocked {@condition unconscious} or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.",
						"Once you have raged the maximum number of times for your barbarian level, you must finish a long rest before you can rage again. You may rage 2 times at 1st level, 3 at 3rd, 4 at 6th, 5 at 12th, and 6 at 17th."
					]
				},
				{
					"name": "Unarmored Defense",
					"entries": [
						"While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
					]
				}
			],
			[
				{
					"name": "Danger Sense",
					"entries": [
						"At 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be {@condition blinded}, {@condition deafened}, or {@condition incapacitated}."
					]
				},
				{
					"name": "Reckless Attack",
					"entries": [
						"Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
					]
				}
			],
			[
				{
					"name": "Primal Path",
					"entries": [
						"At 3rd level, you choose a path that shapes the nature of your rage from the list of available paths. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Extra Attack",
					"entries": [
						"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
					]
				},
				{
					"name": "Fast Movement",
					"entries": [
						"Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor."
					]
				}
			],
			[
				{
					"name": "Path Feature",
					"entries": [
						"At 6th level, you gain a feature from your Primal Path."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Feral Instinct",
					"entries": [
						"By 7th level, your instincts are so honed that you have advantage on initiative rolls.",
						"Additionally, if you are surprised at the beginning of combat and aren't {@condition incapacitated}, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM uses the optional Feats, you can instead take a feat."
					]
				}
			],
			[
				{
					"name": "Brutal Critical (1 die)",
					"entries": [
						"Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.",
						"This increases to two additional dice at 13th level and three additional dice at 17th level."
					]
				}
			],
			[
				{
					"name": "Path feature",
					"entries": [
						"At 10th level, you gain a feature from your Primal Path."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Relentless Rage",
					"entries": [
						"Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.",
						"Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM uses the optional Feats, you can instead take a feat."
					]
				}
			],
			[
				{
					"name": "Brutal Critical (2 dice)",
					"entries": [
						"You now roll two additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
					]
				}
			],
			[
				{
					"name": "Path feature",
					"entries": [
						"At 14th level, you gain a feature from your Primal Path."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Persistent Rage",
					"entries": [
						"Beginning at 15th level, your rage is so fierce that it ends early only if you fall {@condition unconscious} or if you choose to end it."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM uses the optional Feats, you can instead take a feat."
					]
				}
			],
			[
				{
					"name": "Brutal Critical (3 dice)",
					"entries": [
						"You now roll three additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
					]
				}
			],
			[
				{
					"name": "Indomitable Might",
					"entries": [
						"Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM uses the optional Feats, you can instead take a feat."
					]
				}
			],
			[
				{
					"name": "Primal Champion",
					"entries": [
						"At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
					]
				}
			]
		],
		"subclassTitle": "Primal Path"
	},
	{
		"name": "Bard",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 8
		},
		"proficiency": [
			"dex",
			"cha"
		],
		"startingProficiencies": {
			"armor": [
				"light"
			],
			"weapons": [
				"simple",
				"hand crossbows",
				"longswords",
				"rapiers",
				"shortswords"
			],
			"tools": [
				"three musical instruments of your choice"
			],
			"skills": {
				"choose": 3,
				"from": [
					"Athletics",
					"Acrobatics",
					"Sleight of Hand",
					"Stealth",
					"Arcana",
					"History",
					"Investigation",
					"Nature",
					"Religion",
					"Animal Handling",
					"Insight",
					"Medicine",
					"Perception",
					"Survival",
					"Deception",
					"Intimidation",
					"Performance",
					"Persuasion"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a rapier, (b) a longsword, or (c) any simple weapon",
				"(a) a diplomat's pack or (b) an entertainer's pack",
				"(a) a lute or (b) any other musical instrument",
				"Leather armor, and a dagger"
			],
			"goldAlternative": "5d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Bardic Inspiration",
					"entries": [
						"You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6.",
						"Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.",
						"You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.",
						"Your Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level."
					]
				},
				{
					"name": "Spellcasting",
					"entries": [
						"You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations. See chapter 10 for the general rules of spellcasting and chapter 11 for the bard spell list.",
						{
							"type": "entries",
							"name": "Cantrips",
							"entries": [
								"You know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels, learning a 3rd cantrip at 4th level and a 4th at 10th level."
							]
						},
						{
							"type": "entries",
							"name": "Spell Slots",
							"entries": [
								"The Bard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
								"For example, if you know the 1st-level spell {@spell cure wounds} and have a 1st-level and a 2nd-level spell slot available, you can cast {@spell cure wounds} using either slot."
							]
						},
						{
							"type": "entries",
							"name": "Spells Known of 1st Level and Higher",
							"entries": [
								"You know four 1st-level spells of your choice from the bard spell list.",
								"You learn an additional bard spell of your choice at each level except 12th, 16th, 19th, and 20th. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.",
								"Additionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list, which also must be of a level for which you have spell slots."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Ability",
							"entries": [
								"Charisma is your spellcasting ability for your bard spells. Your magic comes from the heart and soul you pour into the performance of your music or oration. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a bard spell you cast and when making an attack roll with one.",
								{
									"type": "abilityDc",
									"name": "Spell",
									"attributes": [
										"cha"
									]
								},
								{
									"type": "abilityAttackMod",
									"name": "Spell",
									"attributes": [
										"cha"
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Ritual Casting",
							"entries": [
								"You can cast any bard spell you know as a ritual if that spell has the ritual tag."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Focus",
							"entries": [
								"You can use a musical instrument (found in chapter 5) as a spellcasting focus for your bard spells."
							]
						}
					]
				}
			],
			[
				{
					"name": "Jack of All Trades",
					"entries": [
						"Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus."
					]
				},
				{
					"name": "Song of Rest (d6)",
					"entries": [
						"Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points by spending Hit Dice at the end of the short rest, each of those creatures regains an extra 1d6 hit points.",
						"The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level."
					]
				}
			],
			[
				{
					"name": "Bard College",
					"entries": [
						"At 3rd level, you delve into the advanced techniques of a bard college of your choice from the list of available colleges. Your choice grants you features at 3rd level and again at 6th and 14th level."
					],
					"gainSubclassFeature": true
				},
				{
					"name": "Expertise",
					"entries": [
						"At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.",
						"At 10th level, you can choose another two skill proficiencies to gain this benefit."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Bardic Inspiration (d8)",
					"entries": [
						"At 5th level, your Bardic Inspiration die changes to a d8."
					]
				},
				{
					"name": "Font of Inspiration",
					"entries": [
						"Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest."
					]
				}
			],
			[
				{
					"name": "Countercharm",
					"entries": [
						"At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being {@condition frightened} or {@condition charmed}. A creature must be able to hear you to gain this benefit. The performance ends early if you are {@condition incapacitated} or silenced or if you voluntarily end it (no action required)."
					]
				},
				{
					"name": "Bard College feature",
					"entries": [
						"At 6th level, you gain a feature from your Bard College."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Song of Rest (d8)",
					"entries": [
						"At 9th level, the extra hit points gained from Song of Rest increases to 1d8."
					]
				}
			],
			[
				{
					"name": "Bardic Inspiration (d10)",
					"entries": [
						"At 10th level, your Bardic Inspiration die changes to a d10."
					]
				},
				{
					"name": "Expertise",
					"entries": [
						"At 10th level, you can choose another two skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies."
					]
				},
				{
					"name": "Magical Secrets",
					"entries": [
						"By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip.",
						"The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table.",
						"You learn two additional spells from any class at 14th level and again at 18th level."
					]
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Song of Rest (d10)",
					"entries": [
						"At 13th level, the extra hit points gained from Song of Rest increases to 1d10."
					]
				}
			],
			[
				{
					"name": "Magical Secrets",
					"entries": [
						"At 14th level, choose two additional spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip.",
						"The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table."
					]
				},
				{
					"name": "Bard College feature",
					"entries": [
						"At 14th level, you gain a feature from your Bard College."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Bardic Inspiration (d12)",
					"entries": [
						"At 15th level, your Bardic Inspiration die changes to a d12."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Song of Rest (d12)",
					"entries": [
						"At 17th level, the extra hit points gained from Song of Rest increases to 1d12."
					]
				}
			],
			[
				{
					"name": "Magical Secrets",
					"entries": [
						"At 18th level, choose two additional spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip.",
						"The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Superior Inspiration",
					"entries": [
						"At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use."
					]
				}
			]
		],
		"subclassTitle": "Bard College"
	},
	{
		"name": "Cleric",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 8
		},
		"proficiency": [
			"wis",
			"cha"
		],
		"startingProficiencies": {
			"armor": [
				"light",
				"medium",
				"shields"
			],
			"weapons": [
				"simple"
			],
			"skills": {
				"choose": 2,
				"from": [
					"History",
					"Insight",
					"Medicine",
					"Persuasion",
					"Religion"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a mace or (b) a warhammer (if proficient)",
				"(a) scale mail, (b) leather armor, or (c) chain mail (if proficient)",
				"(a) a light crossbow and 20 bolts or (b) any simple weapon",
				"(a) a priest's pack or (b) an explorer's pack",
				"A shield and a holy symbol"
			],
			"goldAlternative": "5d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Spellcasting",
					"entries": [
						"As a conduit for divine power, you can cast cleric spells. See chapter 10 for the general rules of spellcasting and chapter 11 for a selection of cleric spells.",
						{
							"type": "entries",
							"name": "Cantrips",
							"entries": [
								"At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table."
							]
						},
						{
							"type": "entries",
							"name": "Preparing and Casting Spells",
							"entries": [
								"The Cleric table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
								"You prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.",
								"For example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell {@spell cure wounds}, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
								"You can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Ability",
							"entries": [
								"Wisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.",
								{
									"type": "abilityDc",
									"name": "Spell",
									"attributes": [
										"wis"
									]
								},
								{
									"type": "abilityAttackMod",
									"name": "Spell",
									"attributes": [
										"wis"
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Ritual Casting",
							"entries": [
								"You can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Focus",
							"entries": [
								"You can use a holy symbol (found in chapter 5) as a spellcasting focus for your cleric spells."
							]
						}
					]
				},
				{
					"name": "Divine Domain",
					"entries": [
						"Choose one domain related to your deity from the list of available domains. Each domain is detailed in their own feature, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.",
						{
							"type": "entries",
							"name": "Domain Spells",
							"entries": [
								"Each domain has a list of spells—its domain spells—that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day.",
								"If you have a domain spell that doesn't appear on the cleric spell list, the spell is nonetheless a cleric spell for you."
							]
						}
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Channel Divinity (1/rest)",
					"entries": [
						"At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.",
						"When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.",
						"Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.",
						"Beginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.",
						{
							"type": "entries",
							"name": "Turn Undead",
							"entries": [
								"As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.",
								"A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action."
							]
						}
					]
				},
				{
					"name": "Divine Domain feature",
					"entries": [
						"At 2nd level, you gain a feature from your Divine Domain."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Destroy Undead (CR 1/2)",
					"entries": [
						"Starting at 5th level, when an undead of CR 1/2 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
					]
				}
			],
			[
				{
					"name": "Channel Divinity (2/rest)",
					"entries": [
						"Beginning at 6th level, you can use your Channel Divinity twice between rests."
					]
				},
				{
					"name": "Divine Domain feature",
					"entries": [
						"At 6th level, you gain a feature from your Divine Domain."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				},
				{
					"name": "Destroy Undead (CR 1)",
					"entries": [
						"Starting at 8th level, when an undead of CR 1 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
					]
				},
				{
					"name": "Divine Domain feature",
					"entries": [
						"At 8th level, you gain a feature from your Divine Domain."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Divine Intervention",
					"entries": [
						"Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.",
						"Imploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.",
						"At 20th level, your call for intervention succeeds automatically, no roll required."
					]
				}
			],
			[
				{
					"name": "Destroy Undead (CR 2)",
					"entries": [
						"Starting at 11th level, when an undead of CR 2 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Destroy Undead (CR 3)",
					"entries": [
						"Starting at 14th level, when an undead of CR 3 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
					]
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Destroy Undead (CR 4)",
					"entries": [
						"Starting at 17th level, when an undead of CR 4 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
					]
				},
				{
					"name": "Divine Domain feature",
					"entries": [
						"At 17th level, you gain a feature from your Divine Domain."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Channel Divinity (3/rest)",
					"entries": [
						"Beginning at 18th level, you can use your Channel Divinity three times between rests."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Divine Intervention Improvement",
					"entries": [
						"At 20th level, your call for intervention succeeds automatically, no roll required."
					]
				}
			]
		],
		"subclassTitle": "Divine Domain"
	},
	{
		"name": "Druid",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 8
		},
		"proficiency": [
			"int",
			"wis"
		],
		"startingProficiencies": {
			"armor": [
				"light",
				"medium",
				"shields (druids will not wear armor or use shields made of metal)"
			],
			"weapons": [
				"clubs",
				"daggers",
				"darts",
				"javelins",
				"maces",
				"quarterstaffs",
				"scimitars",
				"sickles",
				"slings",
				"spears"
			],
			"tools": [
				"herbalism kit"
			],
			"skills": {
				"choose": 2,
				"from": [
					"Arcana",
					"Animal Handling",
					"Insight",
					"Medicine",
					"Nature",
					"Perception",
					"Religion",
					"Survival"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a wooden shield or (b) any simple weapon",
				"(a) a scimitar or (b) any simple melee weapon",
				"Leather armor, an explorer's pack, and a druidic focus"
			],
			"goldAlternative": "2d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Druidic",
					"entries": [
						"You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic."
					]
				},
				{
					"name": "Spellcasting",
					"entries": [
						"Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will. See chapter 10 for the general rules of spellcasting and chapter 11 for the druid spell list.",
						{
							"type": "entries",
							"name": "Cantrips",
							"entries": [
								"At 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table."
							]
						},
						{
							"type": "entries",
							"name": "Preparing and Casting Spells",
							"entries": [
								"The Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
								"You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.",
								"For example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell {@spell cure wounds}, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
								"You can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Ability",
							"entries": [
								"Wisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one.",
								{
									"type": "abilityDc",
									"name": "Spell",
									"attributes": [
										"wis"
									]
								},
								{
									"type": "abilityAttackMod",
									"name": "Spell",
									"attributes": [
										"wis"
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Ritual Casting",
							"entries": [
								"You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Focus",
							"entries": [
								"You can use a druidic focus (found in chapter 5) as a spellcasting focus for your druid spells"
							]
						}
					]
				}
			],
			[
				{
					"name": "Wild Shape",
					"entries": [
						"Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.",
						"Your druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.",
						{
							"type": "table",
							"caption": "Beast Shapes",
							"colLabels": [
								"Level",
								"Max. CR",
								"Limitations",
								"Example"
							],
							"colStyles": [
								"col-xs-2 text-align-center",
								"col-xs-2 text-align-center",
								"col-xs-5",
								"col-xs-3"
							],
							"rows": [
								[
									"{@filter 2nd|bestiary|cr=0;1/8;1/4|type=beast|speed=!fly;!swim|miscellaneous=!swarm}",
									"1/4",
									"No flying or swimming speed",
									"Wolf"
								],
								[
									"{@filter 4th|bestiary|cr=0;1/8;1/4;1/2|type=beast|speed=!fly|miscellaneous=!swarm}",
									"1/2",
									"No flying speed",
									"Crocodile"
								],
								[
									"{@filter 8th|bestiary|cr=0;1/8;1/4;1/2;1|type=beast|speed=null|miscellaneous=!swarm}",
									"1",
									"—",
									"Giant eagle"
								]
							]
						},
						"You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall {@condition unconscious}, drop to 0 hit points, or die.",
						"While you are transformed, the following rules apply:",
						{
							"type": "list",
							"items": [
								"Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.",
								"When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked {@condition unconscious}.",
								"You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as {@spell call lightning}, that you've already cast.",
								"You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense.",
								"You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form."
							]
						}
					]
				},
				{
					"name": "Druid Circle",
					"entries": [
						"At 2nd level, you choose to identify with a circle of druids from the list of available circles. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Wild Shape Improvement",
					"entries": [
						"At 4th level, your Wild Shape improves as shown on the Beast Shapes table."
					]
				},
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Druid Circle feature",
					"entries": [
						"At 6th level, you gain a feature granted by your Druid Circle feature."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Wild Shape Improvement",
					"entries": [
						"At 8th level, your Wild Shape improves as shown on the Beast Shapes table."
					]
				},
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Druid Circle feature",
					"entries": [
						"At 10th level, you gain a feature granted by your Druid Circle feature."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Druid Circle feature",
					"entries": [
						"At 14th level, you gain a feature granted by your Druid Circle feature."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Timeless Body",
					"entries": [
						"Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year."
					]
				},
				{
					"name": "Beast Spells",
					"entries": [
						"Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Archdruid",
					"entries": [
						"At 20th level, you can use your Wild Shape an unlimited number of times.",
						"Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape."
					]
				}
			]
		],
		"subclassTitle": "Druid Circle"
	},
	{
		"name": "Fighter",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 10
		},
		"proficiency": [
			"str",
			"con"
		],
		"startingProficiencies": {
			"armor": [
				"light",
				"medium",
				"heavy",
				"shields"
			],
			"weapons": [
				"simple",
				"martial"
			],
			"skills": {
				"choose": 2,
				"from": [
					"Acrobatics",
					"Animal Handling",
					"Athletics",
					"History",
					"Insight",
					"Intimidation",
					"Perception",
					"Survival"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) chain mail or (b) leather, longbow, and 20 arrows",
				"(a) a martial weapon and a shield or (b) two martial weapons",
				"(a) a light crossbow and 20 bolts or (b) two handaxes",
				"(a) a dungeoneer's pack or (b) an explorer's pack"
			],
			"goldAlternative": "5d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Fighting Style",
					"entries": [
						"You adopt a particular style of fighting as your specialty. Choose a fighting style from the list of optional features. You can't take the same Fighting Style option more than once, even if you get to choose again.",
						{
							"type": "options",
							"entries": [
								{
									"type": "entries",
									"name": "Archery",
									"entries": [
										"You gain a +2 bonus to attack rolls you make with ranged weapons."
									]
								},
								{
									"type": "entries",
									"name": "Close Quarters Shooter",
									"entries": [
										"When making a ranged attack while you are within 5 feet of a hostile creature, you do not have disadvantage on the attack roll. Your ranged attacks ignore half cover and three-quarters cover against targets within 30 feet of you. You have a +1 bonus to attack rolls on ranged attacks."
									],
									"source": "UALightDarkUnderdark"
								},
								{
									"type": "entries",
									"name": "Defense",
									"entries": [
										"While you are wearing armor, you gain a +1 bonus to AC."
									]
								},
								{
									"type": "entries",
									"name": "Dueling",
									"entries": [
										"When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
									]
								},
								{
									"type": "entries",
									"name": "Great Weapon Fighting",
									"entries": [
										"When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit."
									]
								},
								{
									"type": "entries",
									"name": "Mariner",
									"entries": [
										"As long as you are not wearing heavy armor or using a shield, you have a swimming speed and a climbing speed equal to your normal speed, and you gain a +1 bonus to AC."
									],
									"source": "UAWaterborneAdventures"
								},
								{
									"type": "entries",
									"name": "Protection",
									"entries": [
										"When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."
									]
								},
								{
									"type": "entries",
									"name": "Tunnel Fighter",
									"entries": [
										"As a bonus action, you can enter a defensive stance that lasts until the start of your next turn. While in your defensive stance, you can make opportunity attacks without using your reaction, and you can use your reaction to make a melee attack against a creature that moves more than 5 feet while within your reach."
									],
									"source": "UALightDarkUnderdark"
								},
								{
									"type": "entries",
									"name": "Two-Weapon Fighting",
									"entries": [
										"When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
									]
								}
							]
						}
					]
				},
				{
					"name": "Second Wind",
					"entries": [
						"You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level.",
						"Once you use this feature, you must finish a short or long rest before you can use it again."
					]
				}
			],
			[
				{
					"name": "Action Surge",
					"entries": [
						"Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action.",
						"Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."
					]
				}
			],
			[
				{
					"name": "Martial Archetype",
					"entries": [
						"At 3rd level, you choose an archetype from the list available that you strive to emulate in your combat styles and techniques. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Extra Attack",
					"entries": [
						"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
						"The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 6th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Martial Archetype feature",
					"entries": [
						"At 7th level, you gain a feature granted by your Martial Archetype."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Indomitable",
					"entries": [
						"Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest.",
						"You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level."
					]
				}
			],
			[
				{
					"name": "Martial Archetype feature",
					"entries": [
						"At 10th level, you gain a feature granted by your Martial Archetype."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Extra Attack (2)",
					"entries": [
						"At 11th level, you can attack three times whenever you take the Attack action on your turn."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Indomitable (two uses)",
					"entries": [
						"At 13th level, you can use Indomitable twice between long rests."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 14th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Martial Archetype feature",
					"entries": [
						"At 15th level, you gain a feature granted by your Martial Archetype."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Action Surge (two uses)",
					"entries": [
						"At 17th level, you can use Action Surge twice before a rest, but only once on the same turn."
					]
				},
				{
					"name": "Indomitable (three uses)",
					"entries": [
						"At 17th level, you can use Indomitable three times between long rests."
					]
				}
			],
			[
				{
					"name": "Martial Archetype feature",
					"entries": [
						"At 18th level, you gain a feature granted by your Martial Archetype."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Extra Attack (3)",
					"entries": [
						"At 20th level, you can attack four times whenever you take the Attack action on your turn."
					]
				}
			]
		]
	},
	{
		"name": "Monk",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 8
		},
		"proficiency": [
			"str",
			"dex"
		],
		"startingProficiencies": {
			"weapons": [
				"simple",
				"shortswords"
			],
			"tools": [
				"any one type of artisan's tools or any one musical instrument of your choice"
			],
			"skills": {
				"choose": 2,
				"from": [
					"Acrobatics",
					"Athletics",
					"History",
					"Insight",
					"Religion",
					"Stealth"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a shortsword or (b) any simple weapon",
				"(a) a dungeoneer's pack or (b) an explorer's pack",
				"10 darts"
			],
			"goldAlternative": "5d4"
		},
		"classFeatures": [
			[
				{
					"name": "Unarmored Defense",
					"entries": [
						"Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier."
					]
				},
				{
					"name": "Martial Arts",
					"entries": [
						"Your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property.",
						"You gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield.",
						{
							"type": "list",
							"items": [
								"You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.",
								"You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table.",
								"When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn."
							]
						},
						"Certain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama)."
					]
				}
			],
			[
				{
					"name": "Ki",
					"entries": [
						"Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table.",
						"You can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class.",
						"When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.",
						"Some of your ki features require your target to make a saving throw to resist the feature's effects. The saving throw DC is calculated as follows:",
						{
							"type": "abilityDc",
							"name": "Ki",
							"attributes": [
								"wis"
							]
						},
						{
							"type": "entries",
							"name": "Flurry of Blows",
							"entries": [
								"Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action."
							]
						},
						{
							"type": "entries",
							"name": "Patient Defense",
							"entries": [
								"You can spend 1 ki point to take the Dodge action as a bonus action on your turn."
							]
						},
						{
							"type": "entries",
							"name": "Step of the Wind",
							"entries": [
								"You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn."
							]
						}
					]
				},
				{
					"name": "Unarmored Movement",
					"entries": [
						"Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table.",
						"At 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move."
					]
				}
			],
			[
				{
					"name": "Deflect Missiles",
					"entries": [
						"Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.",
						"If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack (range 20/60 feet) with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack."
					]
				},
				{
					"name": "Monastic Tradition",
					"entries": [
						"When you reach 3rd level, you commit yourself to a monastic tradition, chosen from the list of available traditions. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				},
				{
					"name": "Slow Fall",
					"entries": [
						"Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."
					]
				}
			],
			[
				{
					"name": "Extra Attack",
					"entries": [
						"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
					]
				},
				{
					"name": "Stunning Strike",
					"entries": [
						"Starting at 5th level, you can interfere with the flow of ki in an opponent's body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be {@condition stunned} until the end of your next turn."
					]
				}
			],
			[
				{
					"name": "Ki-Empowered Strikes",
					"entries": [
						"Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."
					]
				},
				{
					"name": "Monastic Tradition feature",
					"entries": [
						"At 6th level, you gain one feature granted by your Monastic Tradition."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Evasion",
					"entries": [
						"At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon's lightning breath or a {@spell fireball} spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
					]
				},
				{
					"name": "Stillness of Mind",
					"entries": [
						"Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be {@condition charmed} or {@condition frightened}."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Unarmored Movement improvement",
					"entries": [
						"At 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move."
					]
				}
			],
			[
				{
					"name": "Purity of Body",
					"entries": [
						"At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison."
					]
				}
			],
			[
				{
					"name": "Monastic Tradition feature",
					"entries": [
						"At 11th level, you gain one feature granted by your Monastic Tradition."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Tongue of the Sun and Moon",
					"entries": [
						"Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say."
					]
				}
			],
			[
				{
					"name": "Diamond Soul",
					"entries": [
						"Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws.",
						"Additionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result."
					]
				}
			],
			[
				{
					"name": "Timeless Body",
					"entries": [
						"At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. In addition, you no longer need food or water."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Monastic Tradition feature",
					"entries": [
						"At 17th level, you gain one feature granted by your Monastic Tradition."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Empty Body",
					"entries": [
						"Beginning at 18th level, you can use your action to spend 4 ki points to become {@condition invisible} for 1 minute. During that time, you also have resistance to all damage but force damage.",
						"Additionally, you can spend 8 ki points to cast the {@spell astral projection} spell, without needing material components. When you do so, you can't take any other creatures with you."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Perfect Soul",
					"entries": [
						"At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points."
					]
				}
			]
		],
		"subclassTitle": "Monastic Tradition"
	},
	{
		"name": "Paladin",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 10
		},
		"proficiency": [
			"wis",
			"cha"
		],
		"startingProficiencies": {
			"armor": [
				"light",
				"medium",
				"heavy",
				"shields"
			],
			"weapons": [
				"simple",
				"martial"
			],
			"skills": {
				"choose": 2,
				"from": [
					"Athletics",
					"Insight",
					"Intimidation",
					"Medicine",
					"Persuasion",
					"Religion"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a martial weapon and a shield or (b) two martial weapons",
				"(a) five javelins or (b) any simple melee weapon",
				"(a) a priest's pack or (b) an explorer's pack",
				"Chain mail and a holy symbol"
			],
			"goldAlternative": "5d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Divine Sense",
					"entries": [
						"The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the {@spell hallow} spell.",
						"You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
					]
				},
				{
					"name": "Lay on Hands",
					"entries": [
						"Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5.",
						"As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.",
						"Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.",
						"This feature has no effect on undead and constructs."
					]
				}
			],
			[
				{
					"name": "Divine Smite",
					"entries": [
						"Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend."
					]
				},
				{
					"name": "Fighting Style",
					"entries": [
						"You adopt a particular style of fighting as your specialty. Choose a fighting style from the list of optional features. You can't take the same Fighting Style option more than once, even if you get to choose again.",
						{
							"type": "options",
							"entries": [
								{
									"type": "entries",
									"name": "Close Quarters Shooter",
									"entries": [
										"When making a ranged attack while you are within 5 feet of a hostile creature, you do not have disadvantage on the attack roll. Your ranged attacks ignore half cover and three-quarters cover against targets within 30 feet of you. You have a +1 bonus to attack rolls on ranged attacks."
									],
									"source": "UALightDarkUnderdark"
								},
								{
									"type": "entries",
									"name": "Defense",
									"entries": [
										"While you are wearing armor, you gain a +1 bonus to AC."
									]
								},
								{
									"type": "entries",
									"name": "Dueling",
									"entries": [
										"When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
									]
								},
								{
									"type": "entries",
									"name": "Great Weapon Fighting",
									"entries": [
										"When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll. The weapon must have the two-handed or versatile property for you to gain this benefit."
									]
								},
								{
									"type": "entries",
									"name": "Mariner",
									"entries": [
										"As long as you are not wearing heavy armor or using a shield, you have a swimming speed and a climbing speed equal to your normal speed, and you gain a +1 bonus to AC."
									],
									"source": "UAWaterborneAdventures"
								},
								{
									"type": "entries",
									"name": "Protection",
									"entries": [
										"When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."
									]
								},
								{
									"type": "entries",
									"name": "Tunnel Fighter",
									"entries": [
										"As a bonus action, you can enter a defensive stance that lasts until the start of your next turn. While in your defensive stance, you can make opportunity attacks without using your reaction, and you can use your reaction to make a melee attack against a creature that moves more than 5 feet while within your reach."
									],
									"source": "UALightDarkUnderdark"
								}
							]
						}
					]
				},
				{
					"name": "Spellcasting",
					"entries": [
						"By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. See chapter 10 for the general rules of spellcasting and chapter 11 for the paladin spell list.",
						{
							"type": "entries",
							"name": "Preparing and Casting Spells",
							"entries": [
								"The Paladin table shows how many spell slots you have to cast your spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
								"You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.",
								"For example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd-level, in any combination. If you prepare the 1st-level spell {@spell cure wounds}, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
								"You can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Ability",
							"entries": [
								"Charisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one.",
								{
									"type": "abilityDc",
									"name": "Spell",
									"attributes": [
										"cha"
									]
								},
								{
									"type": "abilityAttackMod",
									"name": "Spell",
									"attributes": [
										"cha"
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Focus",
							"entries": [
								"You can use a holy symbol (found in chapter 5) as a spellcasting focus for your paladin spells."
							]
						}
					]
				}
			],
			[
				{
					"name": "Divine Health",
					"entries": [
						"By 3rd level, the divine magic flowing through you makes you immune to disease."
					]
				},
				{
					"name": "Sacred Oath",
					"entries": [
						"When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Now you choose from the list of available oaths.",
						"Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature.",
						{
							"name": "Oath Spells",
							"entries": [
								"Each oath has a list of associated spells. You gain access to these spells at the leves specified in the oath description. Once you gain access to an oath spell, you always have it prepared. Oath spells don't count against the number of spells you can prepare each day.",
								"If you gain an oath spell that doesn't appear on the paladin spell list, the spell is nonetheless a paladin spell for you."
							]
						},
						{
							"name": "Channel Divinity",
							"entries": [
								"Your oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it.",
								"When you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again.",
								"Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC."
							]
						},
						{
							"name": "Breaking Your Oath",
							"type": "inset",
							"entries": [
								"A paladin tries to hold to the highest standards of conduct, but even the most virtuous paladin is fallible. Sometimes the right path proves too demanding, sometimes a situation calls for the lesser of two evils, and sometimes the heat of emotion causes a paladin to transgress his or her oath.",
								"A paladin who has broken a vow typically seeks absolution from a cleric who shares his or her faith or from another paladin of the same order. The paladin might spend an all-night vigil in prayer as a sign of penitence, or undertake a fast or similar act of self-denial. After a rite of confession and forgiveness, the paladin starts fresh.",
								"If a paladin willfully violates his or her oath and shows no sign of repentance, the consequences can be more serious. At the DM's discretion, an impenitent paladin might be forced to abandon this class and adopt another, or perhaps to take the Oathbreaker paladin option that appears in the Dungeon Master's Guide."
							]
						}
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Extra Attack",
					"entries": [
						"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
					]
				}
			],
			[
				{
					"name": "Aura of Protection",
					"entries": [
						"Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus.",
						"At 18th level, the range of this aura increases to 30 feet."
					]
				}
			],
			[
				{
					"name": "Sacred Oath feature",
					"entries": [
						"At 7th level, you gain a feature granted to you by your Sacred Oath."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Aura of Courage",
					"entries": [
						"Starting at 10th level, you and friendly creatures within 10 feet of you can't be {@condition frightened} while you are conscious.",
						"At 18th level, the range of this aura increases to 30 feet."
					]
				}
			],
			[
				{
					"name": "Improved Divine Smite",
					"entries": [
						"By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage. If you also use your Divine Smite with an attack, you add this damage to the extra damage of your Divine Smite."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Cleansing Touch",
					"entries": [
						"Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch.",
						"You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."
					]
				}
			],
			[
				{
					"name": "Sacred Oath feature",
					"entries": [
						"At 15th level, you gain a feature granted to you by your Sacred Oath."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Aura improvements",
					"entries": [
						"At 18th level, the range of your Aura of Protection increases to 30 feet."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Sacred Oath feature",
					"entries": [
						"At 20th level, you gain a feature granted to you by your Sacred Oath."
					],
					"gainSubclassFeature": true
				}
			]
		],
		"subclassTitle": "Sacred Oath"
	},
	{
		"name": "Ranger",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 10
		},
		"proficiency": [
			"str",
			"dex"
		],
		"startingProficiencies": {
			"armor": [
				"light",
				"medium",
				"shields"
			],
			"weapons": [
				"simple",
				"martial"
			],
			"skills": {
				"choose": 3,
				"from": [
					"Animal Handling",
					"Athletics",
					"Insight",
					"Investigation",
					"Nature",
					"Perception",
					"Stealth",
					"Survival"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) scale mail or (b) leather armor",
				"(a) two shortswords or (b) two simple melee weapons",
				"(a) a dungeoneer's pack or (b) an explorer's pack",
				"A longbow and a quiver of 20 arrows"
			],
			"goldAlternative": "5d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Favored Enemy",
					"entries": [
						"Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy.",
						"Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies.",
						"You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.",
						"When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all.",
						"You choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures."
					]
				},
				{
					"name": "Natural Explorer",
					"entries": [
						"You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you're proficient in.",
						"While traveling for an hour or more in your favored terrain, you gain the following benefits:",
						{
							"type": "list",
							"items": [
								"Difficult terrain doesn't slow your group's travel.",
								"Your group can't become lost except by magical means.",
								"Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.",
								"If you are traveling alone, you can move stealthily at a normal pace.",
								"When you forage, you find twice as much food as you normally would.",
								"While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area."
							]
						},
						"You choose additional favored terrain types at 6th and 10th level."
					]
				}
			],
			[
				{
					"name": "Fighting Style",
					"entries": [
						"At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options: Archery, Defense, Dueling, Mariner, or Two-Weapon Fighting. You can't take a Fighting Style option more than once, even if you later get to choose again.",
						{
							"type": "options",
							"entries": [
								{
									"type": "entries",
									"name": "Archery",
									"entries": [
										"You gain a +2 bonus to attack rolls you make with ranged weapons."
									]
								},
								{
									"type": "entries",
									"name": "Close Quarters Shooter",
									"entries": [
										"When making a ranged attack while you are within 5 feet of a hostile creature, you do not have disadvantage on the attack roll. Your ranged attacks ignore half cover and three-quarters cover against targets within 30 feet of you. You have a +1 bonus to attack rolls on ranged attacks."
									],
									"source": "UALightDarkUnderdark"
								},
								{
									"type": "entries",
									"name": "Defense",
									"entries": [
										"While you are wearing armor, you gain a +1 bonus to AC."
									]
								},
								{
									"type": "entries",
									"name": "Dueling",
									"entries": [
										"When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
									]
								},
								{
									"type": "entries",
									"name": "Mariner",
									"entries": [
										"As long as you are not wearing heavy armor or using a shield, you have a swimming speed and a climbing speed equal to your normal speed, and you gain a +1 bonus to AC."
									],
									"source": "UAWaterborneAdventures"
								},
								{
									"type": "entries",
									"name": "Tunnel Fighter",
									"entries": [
										"As a bonus action, you can enter a defensive stance that lasts until the start of your next turn. While in your defensive stance, you can make opportunity attacks without using your reaction, and you can use your reaction to make a melee attack against a creature that moves more than 5 feet while within your reach."
									],
									"source": "UALightDarkUnderdark"
								},
								{
									"type": "entries",
									"name": "Two-Weapon Fighting",
									"entries": [
										"When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
									]
								}
							]
						}
					]
				},
				{
					"name": "Spellcasting",
					"entries": [
						"By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. See chapter 10 for the general rules of spellcasting and chapter 11 for the ranger spell list.",
						{
							"type": "entries",
							"name": "Spell Slots",
							"entries": [
								"The Ranger table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
								"For example, if you know the 1st-level spell {@spell animal friendship} and have a 1st-level and a 2nd-level spell slot available, you can cast {@spell animal friendship} using either slot."
							]
						},
						{
							"type": "entries",
							"name": "Spells Known of 1st Level and Higher",
							"entries": [
								"You know two 1st-level spells of your choice from the ranger spell list.",
								"The Spells Known column of the Ranger table shows when you learn more ranger spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level.",
								"Additionally, when you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slots."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Ability",
							"entries": [
								"Wisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one.",
								{
									"type": "abilityDc",
									"name": "Spell",
									"attributes": [
										"wis"
									]
								},
								{
									"type": "abilityAttackMod",
									"name": "Spell",
									"attributes": [
										"wis"
									]
								}
							]
						}
					]
				}
			],
			[
				{
					"name": "Ranger Archetype",
					"entries": [
						"At 3rd level, you choose an archetype that you strive to emulate from the list of available archetypes. Your choice grants features at 3rd level, and again at 7th, 11th, and 15th level."
					],
					"gainSubclassFeature": true
				},
				{
					"name": "Primeval Awareness",
					"entries": [
						"Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn't reveal the creatures' location or number."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Extra Attack",
					"entries": [
						"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
					]
				}
			],
			[
				{
					"name": "Favored Enemy and Natural Explorer improvements",
					"entries": [
						"At 6th level, you gain an additional favored terrain.",
						"At 6th level, you choose one additional favored enemy, as well as an associated language. Your choice should reflect the types of monsters you have encountered on your adventures."
					]
				}
			],
			[
				{
					"name": "Ranger Archetype feature",
					"entries": [
						"At 7th level, you gain a feature granted to you by your Ranger Archetype."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				},
				{
					"name": "Land's Stride",
					"entries": [
						"Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.",
						"In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the {@spell entangle} spell."
					]
				}
			],
			[],
			[
				{
					"name": "Hide in Plain Sight",
					"entries": [
						"Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage.",
						"Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit."
					]
				},
				{
					"name": "Natural Explorer improvement",
					"entries": [
						"You gain an additional favored terrain."
					]
				}
			],
			[
				{
					"name": "Ranger Archetype feature",
					"entries": [
						"At 11th level, you gain a feature granted to you by your Ranger Archetype."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Vanish",
					"entries": [
						"Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail."
					]
				},
				{
					"name": "Favored Enemy improvement",
					"entries": [
						"At 14th level, you choose one additional favored enemy, as well as an associated language. Your choice should reflect the types of monsters you have encountered on your adventures."
					]
				}
			],
			[
				{
					"name": "Ranger Archetype feature",
					"entries": [
						"At 15th level, you gain a feature granted to you by your Ranger Archetype."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Feral Senses",
					"entries": [
						"At 18th level, you gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it. You are also aware of the location of any {@condition invisible} creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't {@condition blinded} or {@condition deafened}."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Foe Slayer",
					"entries": [
						"At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."
					]
				}
			]
		],
		"subclassTitle": "Ranger Archetype"
	},
	{
		"name": "Rogue",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 8
		},
		"proficiency": [
			"dex",
			"int"
		],
		"startingProficiencies": {
			"armor": [
				"light"
			],
			"weapons": [
				"simple",
				"hand crossbows",
				"longswords",
				"rapiers",
				"shortswords"
			],
			"tools": [
				"thieves' tools"
			],
			"skills": {
				"choose": 4,
				"from": [
					"Acrobatics",
					"Athletics",
					"Deception",
					"Insight",
					"Intimidation",
					"Investigation",
					"Perception",
					"Performance",
					"Persuasion",
					"Sleight of Hand",
					"Stealth"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a rapier or (b) a shortsword",
				"(a) a shortbow and quiver of 20 arrows or (b) a shortsword",
				"(a) a burglar's pack, (b) a dungeoneer's pack, or (c) an explorer's pack",
				"Leather armor, two daggers, and thieves' tools"
			],
			"goldAlternative": "4d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Expertise",
					"entries": [
						"At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves' tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.",
						"At 6th level, you can choose two more of your proficiencies (in skills or with thieves' tools) to gain this benefit."
					]
				},
				{
					"name": "Sneak Attack",
					"entries": [
						"Beginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon.",
						"You don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't {@condition incapacitated}, and you don't have disadvantage on the attack roll.",
						"The amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table."
					]
				},
				{
					"name": "Thieves' Cant",
					"entries": [
						"During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly.",
						"In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run."
					]
				}
			],
			[
				{
					"name": "Cunning Action",
					"entries": [
						"Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action."
					]
				}
			],
			[
				{
					"name": "Roguish Archetype",
					"entries": [
						"At 3rd level, you choose an archetype that you emulate in the exercise of your rogue abilities from the list of available archetypes. Your archetype choice grants you features at 3rd level and then again at 9th, 13th, and 17th level."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Uncanny Dodge",
					"entries": [
						"Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you."
					]
				}
			],
			[
				{
					"name": "Expertise",
					"entries": [
						"At 6th level, you can choose two more of your proficiencies (in skills or with thieves' tools) to gain the benefit of Expertise."
					]
				}
			],
			[
				{
					"name": "Evasion",
					"entries": [
						"Beginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or an {@spell ice storm} spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Roguish Archetype feature",
					"entries": [
						"At 9th level, you gain a feature granted by your Roguish Archetype."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 10th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Reliable Talent",
					"entries": [
						"By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Roguish Archetype feature",
					"entries": [
						"At 13th level, you gain a feature granted by your Roguish Archetype."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Blindsense",
					"entries": [
						"Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or {@condition invisible} creature within 10 feet of you."
					]
				}
			],
			[
				{
					"name": "Slippery Mind",
					"entries": [
						"By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Roguish Archetype feature",
					"entries": [
						"At 17th level, you gain a feature granted by your Roguish Archetype."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Elusive",
					"entries": [
						"Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren't {@condition incapacitated}."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Stroke of Luck",
					"entries": [
						"At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20.",
						"Once you use this feature, you can't use it again until you finish a short or long rest."
					]
				}
			]
		],
		"subclassTitle": "Roguish Archetype"
	},
	{
		"name": "Sorcerer",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 6
		},
		"proficiency": [
			"con",
			"cha"
		],
		"startingProficiencies": {
			"weapons": [
				"daggers",
				"darts",
				"slings",
				"quarterstaffs",
				"light crossbows"
			],
			"skills": {
				"choose": 2,
				"from": [
					"Arcana",
					"Deception",
					"Insight",
					"Intimidation",
					"Persuasion",
					"Religion"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a light crossbow and 20 bolts or (b) any simple weapon",
				"(a) a component pouch or (b) an arcane focus",
				"(a) a dungeoneer's pack or (b) an explorer's pack",
				"Two daggers"
			],
			"goldAlternative": "3d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Spellcasting",
					"entries": [
						"An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the sorcerer spell list.",
						{
							"type": "entries",
							"name": "Cantrips",
							"entries": [
								"At 1st level, you know four cantrips of your choice from the sorcerer spell list. You learn an additional sorcerer cantrip of your choice at 4th level and another at 10th level."
							]
						},
						{
							"type": "entries",
							"name": "Spell Slots",
							"entries": [
								"The Sorcerer table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these sorcerer spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
								"For example, if you know the 1st-level spell {@spell burning hands} and have a 1st-level and a 2nd-level spell slot available, you can cast {@spell burning hands} using either slot."
							]
						},
						{
							"type": "entries",
							"name": "Spells Known of 1st Level and Higher",
							"entries": [
								"You know two 1st-level spells of your choice from the sorcerer spell list.",
								"You learn an additional sorcerer spell of your choice at each level except 12th, 14th, 16th, 18th, 19th, and 20th. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.",
								"Additionally, when you gain a level in this class, you can choose one of the sorcerer spells you know and replace it with another spell from the sorcerer spell list, which also must be of a level for which you have spell slots."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Ability",
							"entries": [
								"Charisma is your spellcasting ability for your sorcerer spells, since the power of your magic relies on your ability to project your will into the world. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a sorcerer spell you cast and when making an attack roll with one.",
								{
									"type": "abilityDc",
									"name": "Spell",
									"attributes": [
										"cha"
									]
								},
								{
									"type": "abilityAttackMod",
									"name": "Spell",
									"attributes": [
										"cha"
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Focus",
							"entries": [
								"You can use an arcane focus (found in chapter 5) as a spellcasting focus for your sorcerer spells."
							]
						}
					]
				},
				{
					"name": "Sorcerous Origin",
					"entries": [
						"Choose a sorcerous origin, which describes the source of your innate magical power, from the list of available origins",
						"Your choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Font of Magic",
					"entries": [
						"At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects",
						{
							"type": "entries",
							"name": "Sorcery Points",
							"entries": [
								"You have 2 sorcery points, and you gain one additional point every time you level up, to a maximum of 20 at level 20. You can never have more sorcery points than shown on the table for your level. You regain all spent sorcery points when you finish a long rest."
							]
						},
						{
							"type": "entries",
							"name": "Flexible Casting",
							"entries": [
								"You can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels.",
								{
									"type": "entries",
									"name": "Creating Spell Slots",
									"entries": [
										"You can transform unexpended sorcery points into one spell slot as a bonus action on your turn. The created spell slots vanish at the end of a long rest. The Creating Spell Slots table shows the cost of creating a spell slot of a given level. You can create spell slots no higher in level than 5th.",
										{
											"type": "table",
											"caption": "Creating Spell Slots",
											"colLabels": [
												"Spell Slot Level",
												"Sorcery Point Cost"
											],
											"colStyles": [
												"col-xs-6 text-align-center",
												"col-xs-6 text-align-center"
											],
											"rows": [
												[
													"1st",
													"2"
												],
												[
													"2nd",
													"3"
												],
												[
													"3rd",
													"5"
												],
												[
													"4th",
													"6"
												],
												[
													"5th",
													"7"
												]
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "Converting a Spell Slot to Sorcery Points",
									"entries": [
										"As a bonus action on your turn, you can expend one spell slot and gain a number of sorcery points equal to the slot's level."
									]
								}
							]
						}
					]
				}
			],
			[
				{
					"name": "Metamagic",
					"entries": [
						"At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level.",
						"You can use only one Metamagic option on a spell when you cast it, unless otherwise noted.",
						{
							"type": "options",
							"entries": [
								{
									"type": "entries",
									"name": "Careful Spell",
									"entries": [
										"When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell's full force. To do so, you spend 1 sorcery point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell."
									]
								},
								{
									"type": "entries",
									"name": "Distant Spell",
									"entries": [
										"When you cast a spell that has a range of 5 feet or greater, you can spend 1 sorcery point to double the range of the spell.",
										"When you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the spell 30 feet."
									]
								},
								{
									"type": "entries",
									"name": "Empowered Spell",
									"entries": [
										"When you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls.",
										"You can use Empowered Spell even if you have already used a different Metamagic option during the casting of the spell."
									]
								},
								{
									"type": "entries",
									"name": "Extended Spell",
									"entries": [
										"When you cast a spell that has a duration of 1 minute or longer, you can spend 1 sorcery point to double its duration, to a maximum duration of 24 hours."
									]
								},
								{
									"type": "entries",
									"name": "Heightened Spell",
									"entries": [
										"When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 sorcery points to give one target of the spell disadvantage on its first saving throw made against the spell."
									]
								},
								{
									"type": "entries",
									"name": "Quickened Spell",
									"entries": [
										"When you cast a spell that has a casting time of 1 action, you can spend 2 sorcery points to change the casting time to 1 bonus action for this casting."
									]
								},
								{
									"type": "entries",
									"name": "Subtle Spell",
									"entries": [
										"When you cast a spell, you can spend 1 sorcery point to cast it without any somatic or verbal components."
									]
								},
								{
									"type": "entries",
									"name": "Twinned Spell",
									"entries": [
										"When you cast a spell that doesn't have a range of self and is incapable of targeting more than one creature at the spell's current level, you can spend a number of sorcery points equal to the spell's level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip)."
									]
								}
							]
						}
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Sorcerous Origin feature",
					"entries": [
						"At 6th level, you gain a feature granted by your Sorcerous Origin."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Metamagic",
					"entries": [
						"At 10th level, you learn an additional metamagic option."
					]
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Sorcerous Origin feature",
					"entries": [
						"At 14th level, you gain a feature granted by your Sorcerous Origin."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Metamagic",
					"entries": [
						"At 17th level, you learn an additional metamagic option."
					]
				}
			],
			[
				{
					"name": "Sorcerous Origin feature",
					"entries": [
						"At 18th level, you gain a feature granted by your Sorcerous Origin."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Sorcerous Restoration",
					"entries": [
						"At 20th level, you regain 4 expended sorcery points whenever you finish a short rest."
					]
				}
			]
		],
		"subclassTitle": "Sorcerous Origin"
	},
	{
		"name": "Warlock",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 8
		},
		"proficiency": [
			"wis",
			"cha"
		],
		"startingProficiencies": {
			"armor": [
				"light"
			],
			"weapons": [
				"simple"
			],
			"skills": {
				"choose": 2,
				"from": [
					"Arcana",
					"Deception",
					"History",
					"Intimidation",
					"Investigation",
					"Nature",
					"Religion"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a light crossbow and 20 bolts or (b) any simple weapon",
				"(a) a component pouch or (b) an arcane focus",
				"(a) a scholar's pack or (b) a dungeoneer's pack",
				"Leather armor, any simple weapon, and two daggers"
			],
			"goldAlternative": "4d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Pact Magic",
					"entries": [
						"Your arcane research and the magic bestowed on you by your patron have given you facility with spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the warlock spell list.",
						{
							"type": "entries",
							"name": "Cantrips",
							"entries": [
								"You know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Warlock table."
							]
						},
						{
							"type": "entries",
							"name": "Spell Slots",
							"entries": [
								"The Warlock table shows how many spell slots you have. The table also shows what the level of those slots is; all of your spell slots are the same level. To cast one of your warlock spells of 1st level or higher, you must expend a spell slot. You regain all expended spell slots when you finish a short or long rest.",
								"For example, when you are 5th level, you have two 3rd-level spell slots. To cast the 1st-level spell {@spell thunderwave}, you must spend one of those slots, and you cast it as a 3rd-level spell."
							]
						},
						{
							"type": "entries",
							"name": "Spells Known of 1st Level and Higher",
							"entries": [
								"At 1st level, you know two 1st-level spells of your choice from the warlock spell list.",
								"The Spells Known column of the Warlock table shows when you learn more warlock spells of your choice of 1st level and higher. A spell you choose must be of a level no higher than what's shown in the table's Slot Level column for your level. When you reach 6th level, for example, you learn a new warlock spell, which can be 1st, 2nd, or 3rd level.",
								"Additionally, when you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list, which also must be of a level for which you have spell slots."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Ability",
							"entries": [
								"Charisma is your spellcasting ability for your warlock spells, so you use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a warlock spell you cast and when making an attack roll with one.",
								{
									"type": "abilityDc",
									"name": "Spell",
									"attributes": [
										"cha"
									]
								},
								{
									"type": "abilityAttackMod",
									"name": "Spell",
									"attributes": [
										"cha"
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Focus",
							"entries": [
								"You can use an arcane focus (found in chapter 5) as a spellcasting focus for your warlock spells."
							]
						}
					]
				},
				{
					"name": "Otherworldly Patron",
					"entries": [
						"At 1st level, you have struck a bargain with an otherworldly being chosen from the list of available patrons. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Eldritch Invocations",
					"entries": [
						"In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability.",
						"At 2nd level, you gain two eldritch invocations of your choice. Your invocation options are detailed at the end of the class description. When you gain certain warlock levels, you gain additional invocations of your choice.",
						"Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level.",
						"A level prerequisite in an invocation refers to warlock level, not character level.",
						{
							"type": "options",
							"entries": [
								{
									"type": "invocation",
									"name": "Agonizing Blast",
									"prerequisite": "{@spell eldritch blast} cantrip",
									"entries": [
										"When you cast {@spell eldritch blast}, add your Charisma modifier to the damage it deals on a hit."
									]
								},
								{
									"type": "invocation",
									"name": "Arcane Gunslinger",
									"prerequisite": "Pact of the Blade feature",
									"entries": [
										"You can create a pact weapon that is a sidearm or long arm, and you can transform a magical sidearm or long arm into your pact weapon."
									],
									"source": "UAModernMagic"
								},
								{
									"type": "invocation",
									"name": "Armor of Shadows",
									"entries": [
										"You can cast {@spell mage armor} on yourself at will, without expending a spell slot or material components."
									]
								},
								{
									"type": "invocation",
									"name": "Ascendant Step",
									"prerequisite": "9th level",
									"entries": [
										"You can cast {@spell levitate} on yourself at will, without expending a spell slot or material components."
									]
								},
								{
									"type": "invocation",
									"name": "Aspect of the Moon",
									"prerequisite": "The Archfey patron",
									"entries": [
										"You have gained the Maiden of the Moon's favor. You no longer need to sleep and can't be forced to sleep by any means. To gain the benefits of a long rest, you can spend all 8 hours doing light activity, such as reading and keeping watch."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Archfey",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Aspect of the Moon v2",
									"prerequisite": "Pact of the Tome feature",
									"entries": [
										"You no longer need to sleep and can't be forced to sleep by any means. To gain the benefits of a long rest, you can spend all 8 hours doing light activity, such as reading your Book of Shadows and keeping watch."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Beast Speech",
									"entries": [
										"You can cast {@spell speak with animals} at will, without expending a spell slot."
									]
								},
								{
									"type": "invocation",
									"name": "Beguiling Influence",
									"entries": [
										"You gain proficiency in the Deception and Persuasion skills."
									]
								},
								{
									"type": "invocation",
									"name": "Bewitching Whispers",
									"prerequisite": "7th level",
									"entries": [
										"You can cast {@spell compulsion} once using a warlock spell slot. You can't do so again until you finish a long rest."
									]
								},
								{
									"type": "invocation",
									"name": "Book of Ancient Secrets",
									"prerequisite": "Pact of the Tome feature",
									"entries": [
										"You can now inscribe magical rituals in your Book of Shadows. Choose two 1st-level spells that have the ritual tag from any class's spell list. The spells needn't be from the same spell list. The spells appear in the book and don't count against the number of spells you know. With your Book of Shadows in hand, you can cast the chosen spells as rituals. You can't cast the spells except as rituals, unless you've learned them by some other means. You can also cast a warlock spell you know as a ritual if it has the ritual tag.",
										"On your adventures, you can add other ritual spells to your Book of Shadows. When you find such a spell, you can add it to the book if the spell's level is equal to or less than half your warlock level (rounded up) and if you can spare the time to transcribe the spell. For each level of the spell, the transcription process takes 2 hours and costs 50 gp for the rare inks needed to inscribe it."
									]
								},
								{
									"type": "invocation",
									"name": "Burning Hex",
									"prerequisite": "The Hexblade patron",
									"entries": [
										"As a bonus action, you cause a target cursed by your Hexblade's Curse to take fire damage equal to your Charisma modifier (minimum of 1)."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Hexblade (UA)",
										"source": "UAWarlockAndWizard"
									}
								},
								{
									"type": "invocation",
									"name": "Caiphon's Beacon",
									"prerequisite": "The Great Old One patron",
									"entries": [
										"The purple star Caiphon is the doom of inexperienced mariners. Those who use its deceptive light to guide their travels invariably come to ruin. You gain proficiency in the Deception and Stealth skills, and you have advantage on attack rolls against {@condition charmed} creatures."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Great Old One",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Chains of Carceri",
									"prerequisite": "15th level, Pact of the Chain feature",
									"entries": [
										"You can cast {@spell hold monster} at will—targeting a celestial, fiend, or elemental—without expending a spell slot or material components. You must finish a long rest before you can use this invocation on the same creature again."
									]
								},
								{
									"type": "invocation",
									"name": "Chilling Hex",
									"prerequisite": "The Hexblade patron",
									"entries": [
										"As a bonus action, you cause frost to swirl around a target cursed by your Hexblade's Curse, dealing cold damage to each of your enemies within 5 feet of the target. The cold damage equals your Charisma modifier (minimum of 1)."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Hexblade (UA)",
										"source": "UAWarlockAndWizard"
									}
								},
								{
									"type": "invocation",
									"name": "Chronicle of the Raven Queen",
									"prerequisite": "Raven Queen patron, Pact of the Tome feature",
									"entries": [
										"You can place a corpse's hand or similar appendage on your Book of Shadows and ask one question aloud. After 1 minute, the answer appears written in blood in your book. The answer is provided by the dead creature's spirit to the best of its knowledge and is translated into a language of your choice. You must use this ability within 1 minute of a creature's death, and a given creature can only be asked one question in this manner."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Raven Queen (UA)",
										"source": "UAWarlockAndWizard"
									}
								},
								{
									"type": "invocation",
									"name": "Claw of Acamar",
									"prerequisite": "The Great Old One patron, Pact of the Blade feature",
									"entries": [
										"You can create a black, lead flail using your Pact of the Blade feature. The flail's head is sculpted to resemble a pair of grasping tentacles. The weapon has the reach property. When you hit a creature with it, you can expend a spell slot to deal an additional 2d8 necrotic damage to the target per spell level, and you can reduce the creature's speed to 0 feet until the end of your next turn."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Great Old One",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Cloak of Baalzebul",
									"prerequisite": "The Fiend patron",
									"entries": [
										"As a bonus action, you can conjure a swarm of buzzing flies around you. The swarm grants you advantage on Charisma (Intimidation) checks but disadvantage on all other Charisma checks. In addition, a creature that starts its turn within 5 feet of you takes poison damage equal to your Charisma modifier. You can dismiss the swarm with another bonus action."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Fiend",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Cloak of Flies v2",
									"prerequisite": "5th level",
									"entries": [
										"As a bonus action, you can surround yourself with a magical aura that looks like buzzing flies. The aura includes your space, extends 5 feet from you in every direction, and is blocked by total cover. It lasts until you're {@condition incapacitated} or you dismiss it with a bonus action.",
										"The aura grants you advantage on Charisma (Intimidation) checks but disadvantage on all other Charisma checks. Any other creature that starts its turn in the aura takes poison damage equal to your Charisma modifier (minimum of 0 damage).",
										"Once you use this invocation, you can't use it again until you finish a short or long rest."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Curse Bringer",
									"prerequisite": "The Hexblade patron, Pact of the Blade feature",
									"entries": [
										"You can create a greatsword forged from silver, with black runes etched into its blade, using your Pact of the Blade feature. If you reduce a target cursed by your Hexblade's Curse to 0 hit points with this sword, you can immediately change the target of the curse to a different creature. This change doesn't extend the curse's duration.",
										"When you hit a creature with this weapon, you can expend a spell slot to deal an additional 2d8 slashing damage to the target per spell level, and you can reduce the creature's speed to 0 feet until the end of your next turn."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Hexblade (UA)",
										"source": "UAWarlockAndWizard"
									}
								},
								{
									"type": "invocation",
									"name": "Devil's Sight",
									"entries": [
										"You can see normally in darkness, both magical and nonmagical, to a distance of 120 feet."
									]
								},
								{
									"type": "invocation",
									"name": "Dreadful Word",
									"prerequisite": "7th level",
									"entries": [
										"You can cast {@spell confusion} once using a warlock spell slot. You can't do so again until you finish a long rest."
									]
								},
								{
									"type": "invocation",
									"name": "Eldritch Sight",
									"entries": [
										"You can cast {@spell detect magic} at will, without expending a spell slot."
									]
								},
								{
									"type": "invocation",
									"name": "Eldritch Smite v2",
									"prerequisite": "5th level, Pact of the Blade feature",
									"entries": [
										"Once per turn when you hit a creature with your pact weapon, you can expend a warlock spell slot to deal an extra 1d8 force damage to the target, plus another 1d8 per level of the spell slot. If the target takes any of this damage, you can knock the target {@condition prone} if it is Huge or smaller."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Eldritch Spear",
									"prerequisite": "{@spell eldritch blast} cantrip",
									"entries": [
										"When you cast {@spell eldritch blast}, its range is 300 feet."
									]
								},
								{
									"type": "invocation",
									"name": "Eyes of the Rune Keeper",
									"entries": [
										"You can read all writing."
									]
								},
								{
									"type": "invocation",
									"name": "Fiendish Vigor",
									"entries": [
										"You can cast {@spell false life} on yourself at will as a 1st-level spell, without expending a spell slot or material components."
									]
								},
								{
									"type": "invocation",
									"name": "Frost Lance",
									"prerequisite": "The Archfey patron, {@spell eldritch blast} cantrip",
									"entries": [
										"You draw on the gifts of the Prince of Frost to trap your enemies in ice. When you hit a creature with your {@spell eldritch blast} cantrip one or more times on your turn, you can reduce that creature's speed by 10 feet until the end of your next turn."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Archfey",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Frost Lance v2",
									"prerequisite": "{@spell eldritch blast} cantrip",
									"entries": [
										"Once on each of your turns when you hit a creature with your {@spell eldritch blast}, you can reduce that creature's speed by 10 feet until the end of your next turn."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Gaze of Khirad",
									"prerequisite": "7th level, the Great Old One patron",
									"entries": [
										"You gain the piercing gaze of the blue star Khirad. As an action, you can see through solid objects to a range of 30 feet until the end of the current turn. During that time, you perceive objects as ghostly, transparent images."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Great Old One",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Gaze of Two Minds",
									"entries": [
										"You can use your action to touch a willing humanoid and perceive through its senses until the end of your next turn. As long as the creature is on the same plane of existence as you, you can use your action on subsequent turns to maintain this connection, extending the duration until the end of your next turn. While perceiving through the other creature's senses, you benefit from any special senses possessed by that creature, and you are {@condition blinded} and {@condition deafened} to your own surroundings."
									]
								},
								{
									"type": "invocation",
									"name": "Ghostly Gaze v2",
									"prerequisite": "7th level",
									"entries": [
										"As an action, you gain the ability to see through solid objects to a range of 30 feet. Within that range, you have darkvision if you don't already have it. This special sight lasts until the end of the current turn. During that time, you perceive objects as ghostly, transparent images. Once you use this invocation, you can't use it again until you finish a short or long rest."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Gift of the Depths v2",
									"prerequisite": "5th level",
									"entries": [
										"You can breathe underwater, and you gain a swimming speed equal to your walking speed. You can also cast {@spell water breathing} without expending a spell slot. Once you cast it using this invocation, you can't do so again until you finish a long rest."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Gift of the Ever-Living Ones v2",
									"prerequisite": "Pact of the Chain feature",
									"entries": [
										"Whenever you regain hit points while your familiar is within 100 feet of you, treat any dice rolled to determine the hit points you regain as having rolled their maximum value for you."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Grasp of Hadar",
									"prerequisite": "The Great Old One patron, {@spell eldritch blast} cantrip",
									"entries": [
										"Once during your turn when you hit a creature with your {@spell eldritch blast} cantrip, you can move that creature in a straight line 10 feet closer to yourself."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Great Old One",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Grasp of Hadar v2",
									"prerequisite": "{@spell eldritch blast} cantrip",
									"entries": [
										"Once on each of your turns when you hit a creature with your {@spell eldritch blast} cantrip, you can move that creature in a straight line 10 feet closer to yourself."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Green Lord's Gift",
									"prerequisite": "The Archfey patron",
									"entries": [
										"The Green Lord oversees a verdant realm of everlasting summer. Your soul is linked to his power. Whenever you regain hit points, you treat any dice rolled to determine the hit points you regain as having rolled their maximum value."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Archfey",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Improved Pact Weapon",
									"prerequisite": "5th level, Pact of the Blade feature",
									"entries": [
										"Any weapon you create using your Pact of the Blade feature is a +1 weapon. This invocation doesn't affect a magic weapon you transformed into your pact weapon."
									],
									"source": "UAWarlockAndWizard"
								},
								{
									"type": "invocation",
									"name": "Improved Pact Weapon v2",
									"prerequisite": "Pact of the Blade feature",
									"entries": [
										"You can use any weapon you summon with your Pact of the Blade feature as a spellcasting focus for your warlock spells. In addition, the weapon counts as a magic weapon with a +1 bonus to its attack and damage rolls, unless it is already a magic weapon that you transformed into your pact weapon."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Kiss of Mephistopheles",
									"prerequisite": "5th level, the Fiend patron, {@spell eldritch blast} cantrip",
									"entries": [
										"You can channel the fires of Mephistopheles through your {@spell eldritch blast}. When you hit a creature with that cantrip, you can cast {@spell fireball} as a bonus action using a warlock spell slot. However, the spell must be centered on a creature you hit with {@spell eldritch blast}."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Fiend",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Kiss of Mephistopheles v2",
									"prerequisite": "5th level, {@spell eldritch blast} cantrip",
									"entries": [
										"When you hit a creature with your {@spell eldritch blast}, you can cast {@spell fireball} as a bonus action using a warlock spell slot. The spell must be centered on the creature you hit with {@spell eldritch blast}."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Lifedrinker",
									"prerequisite": "12th level, Pact of the Blade feature",
									"entries": [
										"When you hit a creature with your pact weapon, the creature takes extra necrotic damage equal to your Charisma modifier (minimum of 1)."
									]
								},
								{
									"type": "invocation",
									"name": "Mace of Dispater",
									"prerequisite": "The Fiend patron, Pact of the Blade feature",
									"entries": [
										"When you create your pact weapon as a mace, it manifests as an iron mace forged in Dis, the second of the Nine Hells. When you hit a creature with it, you can expend a spell slot to deal an additional 2d8 force damage to the target per spell level, and you can knock the target {@condition prone} if it is Huge or smaller."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Fiend",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Maddening Hex v2",
									"prerequisite": "5th level",
									"entries": [
										"As a bonus action, you cause a psychic disturbance around the target cursed by your hex spell or by a warlock feature of yours, such as Hexblade's Curse and Sign of Ill Omen. When you do so, you deal psychic damage to the target and each creature of your choice within 5 feet of it. The psychic damage equals your Charisma modifier (minimum of 0 damage)."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Mask of Many Faces",
									"entries": [
										"You can cast {@spell disguise self} at will, without expending a spell slot."
									]
								},
								{
									"type": "invocation",
									"name": "Master of Myriad Forms",
									"prerequisite": "15th level",
									"entries": [
										"You can cast {@spell alter self} at will, without expending a spell slot."
									]
								},
								{
									"type": "invocation",
									"name": "Minions of Chaos",
									"prerequisite": "9th level",
									"entries": [
										"You can cast {@spell conjure elemental} once using a warlock spell slot. You can't do so again until you finish a long rest."
									]
								},
								{
									"type": "invocation",
									"name": "Mire the Mind",
									"prerequisite": "5th level",
									"entries": [
										"You can cast {@spell slow} once using a warlock spell slot. You can't do so again until you finish a long rest."
									]
								},
								{
									"type": "invocation",
									"name": "Misty Visions",
									"entries": [
										"You can cast {@spell silent image} at will, without expending a spell slot or material components."
									]
								},
								{
									"type": "invocation",
									"name": "Moon Bow",
									"prerequisite": "The Archfey patron, Pact of the Blade feature",
									"entries": [
										"You can create a longbow using your Pact of the Blade feature. When you draw back its string and fire, it creates an arrow of white wood, which vanishes after 1 minute. You have advantage on attack rolls against lycanthropes with the bow. When you hit a creature with it, you can expend a spell slot to deal an additional 2d8 radiant damage to the target per spell level."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Archfey",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "One with Shadows",
									"prerequisite": "5th level",
									"entries": [
										"When you are in an area of dim light or darkness, you can use your action to become {@condition invisible} until you move or take an action or a reaction."
									]
								},
								{
									"type": "invocation",
									"name": "Otherworldly Leap",
									"prerequisite": "9th level",
									"entries": [
										"You can cast {@spell jump} on yourself at will, without expending a spell slot or material components."
									]
								},
								{
									"type": "invocation",
									"name": "Path of the Seeker",
									"prerequisite": "The Seeker patron",
									"entries": [
										"The Seeker bids you to travel in search of knowledge, and little can prevent you from walking this path. You ignore difficult terrain, have advantage on all checks to escape a grapple, manacles, or rope bindings, and advantage on saving throws against being {@condition paralyzed}."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Seeker (UA)",
										"source": "UATheFaithful"
									}
								},
								{
									"type": "invocation",
									"name": "Raven Queen's Blessing",
									"prerequisite": "Raven Queen patron, {@spell eldritch blast} cantrip",
									"entries": [
										"When you score a critical hit with your {@spell eldritch blast} cantrip, pick yourself or an ally you can see within 30 feet of you. The chosen creature can immediately expend a Hit Die to regain hit points equal to the roll + the creature's Constitution modifier (minimum of 1 hit point)."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Raven Queen (UA)",
										"source": "UAWarlockAndWizard"
									}
								},
								{
									"type": "invocation",
									"name": "Relentless Hex",
									"prerequisite": "5th level, the Hexblade patron",
									"entries": [
										"Your Hexblade's Curse creates a temporary bond between you and your target. As a bonus action, you can magically teleport to a space you can see within 5 feet of the target cursed by your Hexblade's Curse. To do so, you must be able to see the target and must be within 30 feet of it."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Hexblade (UA)",
										"source": "UAWarlockAndWizard"
									}
								},
								{
									"type": "invocation",
									"name": "Relentless Hex v2",
									"prerequisite": "7th level",
									"entries": [
										"Your curse creates a temporary bond between you and your target. As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see within 5 feet of the target cursed by your hex spell or by a warlock feature of yours, such as Hexblade's Curse and Sign of Ill Omen. To teleport in this way, you must be able to see the cursed target."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Repelling Blast",
									"prerequisite": "{@spell eldritch blast} cantrip",
									"entries": [
										"When you hit a creature with {@spell eldritch blast}, you can push the creature up to 10 feet away from you in a straight line."
									]
								},
								{
									"type": "invocation",
									"name": "Sculptor of Flesh",
									"prerequisite": "7th level",
									"entries": [
										"You can cast {@spell polymorph} once using a warlock spell slot. You can't do so again until you finish a long rest."
									]
								},
								{
									"type": "invocation",
									"name": "Sea Twins' Gift",
									"prerequisite": "The Archfey patron",
									"entries": [
										"The Sea Twins rule seas in the Feywild. Their gift allows you to travel through water with ease. You can breathe underwater, and you gain a swimming speed equal to your walking speed.",
										"You can also cast {@spell water breathing} using a warlock spell slot. Once you cast it using this invocation, you can't do so again until you finish a long rest."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Archfey",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Seeker's Speech",
									"prerequisite": "The Seeker patron",
									"entries": [
										"Your quest for knowledge allows you to master any spoken language. When you complete a long rest, you can pick two languages. You gain the ability to speak, read, and write the chosen languages until you finish your next long rest."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Seeker (UA)",
										"source": "UATheFaithful"
									}
								},
								{
									"type": "invocation",
									"name": "Shroud of Shadow v2",
									"prerequisite": "15th level",
									"entries": [
										"You can cast {@spell invisibility} at will, without expending a spell slot."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Shroud of Ulban",
									"prerequisite": "18th level, the Great Old One patron",
									"entries": [
										"The blue-white star Ulban maintains a fickle presence among the stars, fluttering into view only to herald a dire omen. As an action, you can turn {@condition invisible} for 1 minute. If you attack, deal damage, or force a creature to make a saving throw, you become visible at the end of the current turn."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Great Old One",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Signs of Ill Omen",
									"prerequisite": "5th level",
									"entries": [
										"You can cast {@spell bestow curse} once using a warlock spell slot. You can't do so again until you finish a long rest."
									]
								},
								{
									"type": "invocation",
									"name": "Superior Pact Weapon",
									"prerequisite": "9th level, Pact of the Blade feature",
									"entries": [
										"Any weapon you create using your Pact of the Blade feature is a +2 weapon. This invocation doesn't affect a magic weapon you transformed into your pact weapon."
									],
									"source": "UAWarlockAndWizard"
								},
								{
									"type": "invocation",
									"name": "Thief of Five Fates",
									"entries": [
										"You can cast {@spell bane} once using a warlock spell slot. You can't do so again until you finish a long rest."
									]
								},
								{
									"type": "invocation",
									"name": "Thirsting Blade",
									"prerequisite": "5th level, Pact of the Blade feature",
									"entries": [
										"You can attack with your pact weapon twice, instead of once, whenever you take the Attack action on your turn."
									]
								},
								{
									"type": "invocation",
									"name": "Tomb of Levistus",
									"prerequisite": "The Fiend patron",
									"entries": [
										"As a reaction when you take damage, you can entomb yourself in ice, which melts away at the end of your next turn. You gain 10 temporary hit points per warlock level, which take as much of the triggering damage as possible. You also gain vulnerability to fire damage, your speed drops to 0, and you are {@condition incapacitated}. All of these effects end when the ice melts.",
										"Once you use this invocation, you can't use it again until you finish a short or long rest."
									],
									"source": "UAWarlockAndWizard",
									"subclass": {
										"name": "The Fiend",
										"source": "PHB"
									}
								},
								{
									"type": "invocation",
									"name": "Tomb of Levistus v2",
									"prerequisite": "5th level",
									"entries": [
										"As a reaction when you take damage, you can entomb yourself in ice, which melts away at the end of your next turn. You gain 10 temporary hit points per warlock level, which take as much of the triggering damage as possible. You also gain vulnerability to fire damage, your speed is reduced to 0, and you are {@condition incapacitated}. These effects all end when the ice melts.",
										"Once you use this invocation, you can't use it again until you finish a short or long rest."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Trickster's Escape v2",
									"prerequisite": "7th level",
									"entries": [
										"You can cast {@spell freedom of movement} once on yourself without expending a spell slot. You regain the ability to do so when you finish a long rest."
									],
									"source": "UARevisedClassOptions"
								},
								{
									"type": "invocation",
									"name": "Ultimate Pact Weapon",
									"prerequisite": "15th level, Pact of the Blade feature",
									"entries": [
										"Any weapon you create using your Pact of the Blade feature is a +3 weapon. This invocation doesn't affect a magic weapon you transformed into your pact weapon."
									],
									"source": "UAWarlockAndWizard"
								},
								{
									"type": "invocation",
									"name": "Visions of Distant Realms",
									"prerequisite": "15th level",
									"entries": [
										"You can cast {@spell arcane eye} at will, without expending a spell slot."
									]
								},
								{
									"type": "invocation",
									"name": "Voice of the Chain Master",
									"prerequisite": "Pact of the Chain feature",
									"entries": [
										"You can communicate telepathically with your familiar and perceive through your familiar's senses as long as you are on the same plane of existence. Additionally, while perceiving through your familiar's senses, you can also speak through your familiar in your own voice, even if your familiar is normally incapable of speech."
									]
								},
								{
									"type": "invocation",
									"name": "Whispers of the Grave",
									"prerequisite": "9th level",
									"entries": [
										"You can cast {@spell speak with dead} at will, without expending a spell slot."
									]
								},
								{
									"type": "invocation",
									"name": "Witch Sight",
									"prerequisite": "15th level",
									"entries": [
										"You can see the true form of any shapechanger or creature concealed by illusion or transmutation magic while the creature is within 30 feet of you and within line of sight."
									]
								},
								{
									"type": "invocation",
									"name": "Aspect of the Moon",
									"prerequisite": "Pact of the Tome feature",
									"entries": [
										"You no longer need to sleep and can't be forced to sleep by any means. To gain the benefits of a long rest, you can spend all 8 hours doing light activity, such as reading your Book of Shadows and keeping watch."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Cloak of Flies",
									"prerequisite": "5th level",
									"entries": [
										"As a bonus action, you can surround yourself with a magical aura that looks like buzzing flies. The aura extends 5 feet from you in every direction, but not through total cover. It lasts until you're {@condition incapacitated} or you dismiss it as a bonus action.",
										"The aura grants you advantage on Charisma (Intimidation) checks but disadvantage on all other Charisma checks. Any other creature that starts its turn in the aura takes poison damage equal to your Charisma modifier (minimum of 0 damage).",
										"Once you use this invocation, you can't use it again until you finish a short or long rest."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Eldritch Smite",
									"prerequisite": "5th level, Pact of the Blade feature",
									"entries": [
										"Once per turn when you hit a creature with your pact weapon, you can expend a warlock spell slot to deal an extra 1d8 force damage to the target, plus another 1d8 per level of the spell slot, and you can knock the target {@condition prone} if it is Huge or smaller."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Ghostly Gaze",
									"prerequisite": "7th level",
									"entries": [
										"As an action, you gain the ability to see through solid objects to a range of 30 feet. Within that range, you have darkvision if you don't already have it. This special sight lasts for 1 minute or until your concentration ends (as if you were concentrating on a spell). During that time, you perceive objects as ghostly, transparent images.",
										"Once you use this invocation, you can't use it again until you finish a short or long rest."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Gift of the Depths",
									"prerequisite": "5th level",
									"entries": [
										"You can breathe underwater, and you gain a swimming speed equal to your walking speed.",
										"You can also cast {@spell water breathing} once without expending a spell slot. You regain the ability to do so when you finish a long rest."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Gift of the Ever-Living Ones",
									"prerequisite": "Pact of the Chain feature",
									"entries": [
										"Whenever you regain hit points while your familiar is within 100 feet of you, treat any dice rolled to determine the hit points you regain as having rolled their maximum value for you."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Grasp of Hadar",
									"prerequisite": "{@spell eldritch blast} cantrip",
									"entries": [
										"Once on each of your turns when you hit a creature with your {@spell eldritch blast}, you can move that creature in a straight line 10 feet closer to you."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Improved Pact Weapon",
									"prerequisite": "Pact of the Blade feature",
									"entries": [
										"You can use any weapon you summon with your Pact of the Blade feature as a spellcasting focus for your warlock spells.",
										"In addition, the weapon gains a +1 bonus to its attack and damage rolls, unless it is a magic weapon that already has a bonus to those rolls.",
										"Finally, the weapon you conjure can be a shortbow, longbow, light crossbow, or heavy crossbow."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Lance of Lethargy",
									"prerequisite": "{@spell eldritch blast} cantrip",
									"entries": [
										"Once on each of your turns when you hit a creature with your {@spell eldritch blast}, you can reduce that creature's speed by 10 feet until the end of your next turn."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Maddening Hex",
									"prerequisite": "5th level, hex spell or a warlock feature that curses",
									"entries": [
										"As a bonus action, you cause a psychic disturbance around the target cursed by your hex spell or by a warlock feature of yours, such as Hexblade's Curse or Sign of Ill Omen. When you do so, you deal psychic damage to the cursed target and each creature of your choice that you can see within 5 feet of it. The psychic damage equals your Charisma modifier (minimum of 1 damage). To use this invocation, you must be able to see the cursed target, and it must be within 30 feet of you."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Relentless Hex",
									"prerequisite": "7th level, hex spell or a warlock feature that curses",
									"entries": [
										"Your curse creates a temporary bond between you and your target. As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see within 5 feet of the target cursed by your hex spell or by a warlock feature of yours, such as Hexblade's Curse or Sign of Ill Omen. To teleport in this way, you must be able to see the cursed target."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Shroud of Shadow",
									"prerequisite": "15th level",
									"entries": [
										"You can cast {@spell invisibility} at will, without expending a spell slot."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Tomb of Levistus",
									"prerequisite": "5th level",
									"entries": [
										"As a reaction when you take damage, you can entomb yourself in ice, which melts away at the end of your next turn. You gain 10 temporary hit points per warlock level, which take as much of the triggering damage as possible. Immediately after you take the damage, you gain vulnerability to fire damage, your speed is reduced to 0, and you are {@condition incapacitated}. These effects, including any remaining temporary hit points, all end when the ice melts.",
										"Once you use this invocation, you can't use it again until you finish a short or long rest."
									],
									"source": "XGE"
								},
								{
									"type": "invocation",
									"name": "Trickster's Escape",
									"prerequisite": "7th level",
									"entries": [
										"You can cast {@spell freedom of movement} once on yourself without expending a spell slot. You regain the ability to do so when you finish a long rest."
									],
									"source": "XGE"
								}
							]
						}
					]
				}
			],
			[
				{
					"name": "Pact Boon",
					"entries": [
						"At 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice.",
						{
							"type": "options",
							"entries": [
								{
									"type": "patron",
									"name": "Pact of the Chain",
									"entries": [
										"You learn the {@spell find familiar} spell and can cast it as a ritual. The spell doesn't count against your number of spells known.",
										"When you cast the spell, you can choose one of the normal forms for your familiar or one of the following special forms: {@creature imp}, {@creature pseudodragon}, {@creature quasit}, or {@creature sprite}.",
										"Additionally, when you take the Attack action, you can forgo one of your own attacks to allow your familiar to use its reaction to make one attack of its own."
									]
								},
								{
									"type": "patron",
									"name": "Pact of the Blade",
									"entries": [
										"You can use your action to create a pact weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it (see chapter 5 for weapon options). You are proficient with it while you wield it. This weapon counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
										"Your pact weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the weapon (no action required), or if you die.",
										"You can transform one magic weapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. You can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can't affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform the 1-hour ritual on a different weapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks."
									]
								},
								{
									"type": "patron",
									"name": "Pact of the Tome",
									"entries": [
										"Your patron gives you a grimoire called a Book of Shadows. When you gain this feature, choose three cantrips from any class's spell list. The cantrips do not need to be from the same spell list. While the book is on your person, you can cast those cantrips at will. They don't count against your number of cantrips known. Any cantrip you cast with this feature is considered a warlock cantrip for you. If you lose your Book of Shadows, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous book. The book turns to ash when you die."
									]
								},
								{
									"type": "patron",
									"name": "Pact of the Star Chain",
									"entries": [
										"At 3rd level, a character dedicated to the Seeker can select this option instead of one of the warlock's existing Pact Boon options.",
										"The Seeker grants you a chain forged from starlight, decorated with seven gleaming motes of brightness. While the chain is on your person, you know the {@spell augury} spell and can cast it as a ritual. The spell doesn't count against your number of spells known.",
										"Additionally, you can invoke the Seeker's power to gain advantage on an Intelligence check while you carry this item. Once you use this ability, you cannot use it again until you complete a short or long rest.",
										"If you lose your Star Chain, you can perform a 1-­hour ceremony to receive a replacement from the Seeker. The ceremony can be performed during a short or long rest, and it destroys the previous chain. The chain disappears in a flash of light when you die.",
										"The exact form of this item might be different depending on your patron. The Star Chain is inspired by the Greyhawk deity Celestian."
									],
									"source": "UATheFaithful",
									"subclass": {
										"name": "The Seeker (UA)",
										"source": "UATheFaithful"
									}
								}
							]
						}
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Otherworldly Patron feature",
					"entries": [
						"At 6th level, you gain a feature granted by your Otherworldly Patron."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Otherworldly Patron feature",
					"entries": [
						"At 10th level, you gain a feature granted by your Otherworldly Patron."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Mystic Arcanum (6th level)",
					"entries": [
						"At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one {@filter 6th-level spell from the warlock spell list|spells|level=6|class=Warlock} as this arcanum.",
						"You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.",
						"At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Mystic Arcanum (7th level)",
					"entries": [
						"At 13th level, your patron bestows upon you a magical secret called an arcanum. Choose one {@filter 7th-level spell from the warlock spell list|spells|level=7|class=Warlock} as this arcanum.",
						"You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again."
					]
				}
			],
			[
				{
					"name": "Otherworldly Patron feature",
					"entries": [
						"At 14th level, you gain a feature granted by your Otherworldly Patron."
					],
					"gainSubclassFeature": true
				}
			],
			[
				{
					"name": "Mystic Arcanum (8th level)",
					"entries": [
						"At 15th level, your patron bestows upon you a magical secret called an arcanum. Choose one {@filter 8th-level spell from the warlock spell list|spells|level=8|class=Warlock} as this arcanum.",
						"You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Mystic Arcanum (9th level)",
					"entries": [
						"At 17th level, your patron bestows upon you a magical secret called an arcanum. Choose one {@filter 9th-level spell from the warlock spell list|spells|level=9|class=Warlock} as this arcanum.",
						"You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again."
					]
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Eldritch Master",
					"entries": [
						"At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."
					]
				}
			]
		],
		"subclassTitle": "Otherworldly Patron"
	},
	{
		"name": "Wizard",
		"source": "PHB",
		"hd": {
			"number": 1,
			"faces": 6
		},
		"proficiency": [
			"int",
			"wis"
		],
		"startingProficiencies": {
			"weapons": [
				"daggers",
				"darts",
				"slings",
				"quarterstaffs",
				"light crossbows"
			],
			"skills": {
				"choose": 2,
				"from": [
					"Arcana",
					"History",
					"Insight",
					"Investigation",
					"Medicine",
					"Religion"
				]
			}
		},
		"startingEquipment": {
			"additionalFromBackground": true,
			"default": [
				"(a) a quarterstaff or (b) a dagger",
				"(a) a component pouch or (b) an arcane focus",
				"(a) a scholar's pack or (b) an explorer's pack",
				"A spellbook"
			],
			"goldAlternative": "4d4 × 10"
		},
		"classFeatures": [
			[
				{
					"name": "Arcane Recovery",
					"entries": [
						"You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.",
						"For example, if you're a 4th-level wizard, you can recover up to two levels worth of spell slots.",
						"You can recover either a 2nd-level spell slot or two 1st-level spell slots."
					]
				},
				{
					"name": "Spellcasting",
					"entries": [
						"As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power. See chapter 10 for the general rules of spellcasting and chapter 11 for the wizard spell list.",
						{
							"type": "entries",
							"name": "Cantrips",
							"entries": [
								"At 1st level, you know three cantrips of your choice from the wizard spell list. You learn additional wizard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Wizard table."
							]
						},
						{
							"type": "entries",
							"name": "Spellbook",
							"entries": [
								"At 1st level, you have a spellbook containing six 1st-level wizard spells of your choice. Your spellbook is the repository of the wizard spells you know, except your cantrips, which are fixed in your mind."
							]
						},
						{
							"type": "entries",
							"name": "Preparing and Casting Spells",
							"entries": [
								"The Wizard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
								"You prepare the list of wizard spells that are available for you to cast. To do so, choose a number of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell). The spells must be of a level for which you have spell slots.",
								"For example, if you're a 3rd-level wizard, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination, chosen from your spellbook. If you prepare the 1st-level spell {@spell magic missile}, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
								"You can change your list of prepared spells when you finish a long rest. Preparing a new list of wizard spells requires time spent studying your spellbook and memorizing the incantations and gestures you must make to cast the spell: at least 1 minute per spell level for each spell on your list."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Ability",
							"entries": [
								"Intelligence is your spellcasting ability for your wizard spells, since you learn your spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one.",
								{
									"type": "abilityDc",
									"name": "Spell",
									"attributes": [
										"int"
									]
								},
								{
									"type": "abilityAttackMod",
									"name": "Spell",
									"attributes": [
										"int"
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Ritual Casting",
							"entries": [
								"You can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don't need to have the spell prepared."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting Focus",
							"entries": [
								"You can use an arcane focus (found in chapter 5) as a spellcasting focus for your wizard spells."
							]
						},
						{
							"type": "entries",
							"name": "Learning Spells of 1st Level and Higher",
							"entries": [
								"Each time you gain a wizard level, you can add two wizard spells of your choice to your spellbook. Each of these spells must be of a level for which you have spell slots, as shown on the Wizard table. On your adventures, you might find other spells that you can add to your spellbook (see \"Your Spellbook\")."
							]
						},
						{
							"type": "inset",
							"name": "Your Spellbook",
							"entries": [
								"The spells that you add to your spellbook as you gain levels reflect the arcane research you conduct on your own, as well as intellectual breakthroughs you have had about the nature of the multiverse. You might find other spells during your adventures. You could discover a spell recorded on a scroll in an evil wizard's chest, for example, or in a dusty tome in an ancient library.",
								"A spellbook doesn't contain cantrips.",
								{
									"type": "entries",
									"entries": [
										{
											"type": "entries",
											"name": "Copying a Spell into the Book",
											"entries": [
												"When you find a wizard spell of 1st level or higher, you can add it to your spellbook if it is of a spell level you can prepare and if you can spare the time to decipher and copy it.",
												"Copying a spell into your spellbook involves reproducing the basic form of the spell, then deciphering the unique system of notation used by the wizard who wrote it. You must practice the spell until you understand the sounds or gestures required, then transcribe it into your spellbook using your own notation.",
												"For each level of the spell, the process takes 2 hours and costs 50 gp. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it. Once you have spent this time and money, you can prepare the spell just like your other spells.",
												"A wizard spell on a spell scroll can be copied just as spells in spellbooks can be copied. When you copy a spell from a spell scroll, you must succeed on an Intelligence (Arcana) check with a DC equal to 10 + the spell's level. If the check succeeds, the spell is successfully copied. Whether the check succeeds or fails, the spell scroll is destroyed."
											]
										}
									]
								},
								{
									"type": "entries",
									"entries": [
										{
											"type": "entries",
											"name": "Replacing the Book",
											"entries": [
												"You can copy a spell from your own spellbook into another book—for example, if you want to make a backup copy of your spellbook. This is just like copying a new spell into your spellbook, but faster and easier, since you understand your own notation and already know how to cast the spell. You need spend only 1 hour and 10 gp for each level of the copied spell.",
												"If you lose your spellbook, you can use the same procedure to transcribe the spells that you have prepared into a new spellbook. Filling out the remainder of your spellbook requires you to find new spells to do so, as normal. For this reason, many wizards keep backup spellbooks in a safe place."
											]
										}
									]
								},
								{
									"type": "entries",
									"entries": [
										{
											"type": "entries",
											"name": "The Book's Appearance",
											"entries": [
												"Your spellbook is a unique compilation of spells, with its own decorative flourishes and margin notes. It might be a plain, functional leather volume that you received as a gift from your master, a finely bound gilt-edged tome you found in an ancient library, or even a loose collection of notes scrounged together after you lost your previous spellbook in a mishap."
											]
										}
									]
								}
							]
						}
					]
				}
			],
			[
				{
					"name": "Arcane Tradition",
					"entries": [
						"When you reach 2nd level, you choose an arcane tradition from the list of available traditions, shaping your practice of magic. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Arcane Tradition feature",
					"entries": [
						"At 6th level, you gain a feature granted by your Arcane Tradition."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Arcane Tradition feature",
					"entries": [
						"At 10th level, you gain a feature granted by your Arcane Tradition."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Arcane Tradition feature",
					"entries": [
						"At 14th level, you gain a feature granted by your Arcane Tradition."
					],
					"gainSubclassFeature": true
				}
			],
			[],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[],
			[
				{
					"name": "Spell Mastery",
					"entries": [
						"At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal.",
						"By spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels."
					]
				}
			],
			[
				{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}
			],
			[
				{
					"name": "Signature Spells",
					"entries": [
						"When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest.",
						"If you want to cast either spell at a higher level, you must expend a spell slot as normal."
					]
				}
			]
		],
		"subclassTitle": "Arcane Tradition"
	}
]