[
	{
		"race": "Elf",
		"name": "Drow",
		"ability": {
			"cha": 1
		},
		"darkvision": 120,
		"entries": [
			{
				"name": "Superior Darkvision",
				"entries": [
					"Accustomed to the depths of the Underdark, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
				],
				"data": {
					"overwrite": "Darkvision"
				},
				"type": "entries"
			},
			{
				"name": "Sunlight Sensitivity",
				"entries": [
					"You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
				],
				"type": "entries"
			},
			{
				"name": "Drow Magic",
				"entries": [
					"You know the {@spell dancing lights} cantrip. When you reach 3rd level, you can cast the {@spell faerie fire} spell once per day; you must finish a long rest in order to cast the spell again using this trait. When you reach 5th level, you can also cast the {@spell darkness} spell once per day; you must finish a long rest in order to cast the spell again using this trait. Charisma is your spellcasting ability for these spells."
				],
				"type": "entries"
			},
			{
				"name": "Drow Weapon Training",
				"entries": [
					"You have proficiency with rapiers, shortswords, and hand crossbows."
				],
				"type": "entries"
			}
		]
	},
	{
		"race": "Elf",
		"name": "High",
		"speed": 30,
		"ability": {
			"int": 1
		},
		"entries": [
			{
				"name": "Elf Weapon Training",
				"entries": [
					"You have proficiency with the longsword, shortsword, shortbow, and longbow."
				],
				"type": "entries"
			},
			{
				"name": "Cantrip",
				"entries": [
					"You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it."
				],
				"type": "entries"
			},
			{
				"name": "Extra Language",
				"entries": [
					"You can speak, read, and write one extra language of your choosing."
				],
				"type": "entries"
			}
		]
	},
	{
		"race": "Elf",
		"name": "Wood",
		"speed": 35,
		"ability": {
			"wis": 1
		},
		"entries": [
			{
				"name": "Elf Weapon Training",
				"entries": [
					"You have proficiency with the longsword, shortsword, shortbow, and longbow."
				],
				"type": "entries"
			},
			{
				"name": "Fleet of Foot",
				"entries": [
					"Your base walking speed increases to 35 feet."
				],
				"type": "entries"
			},
			{
				"name": "Mask of the Wild",
				"entries": [
					"You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
				],
				"type": "entries"
			}
		]
	},
	{
		"race": "Gnome",
		"name": "Forest",
		"ability": {
			"dex": 1
		},
		"entries": [
			{
				"name": "Natural Illusionist",
				"entries": [
					"You know the {@spell minor illusion} cantrip. Intelligence is your spellcasting ability for it."
				],
				"type": "entries"
			},
			{
				"name": "Speak with Small Beasts",
				"entries": [
					"Through sounds and gestures, you can communicate simple ideas with Small or smaller beasts. Forest gnomes love animals and often keep squirrels, badgers, rabbits, moles, woodpeckers, and other creatures as beloved pets."
				],
				"type": "entries"
			}
		]
	},
	{
		"race": "Gnome",
		"name": "Rock",
		"ability": {
			"con": 1
		},
		"entries": [
			{
				"name": "Artificer's Lore",
				"entries": [
					"Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply."
				],
				"type": "entries"
			},
			{
				"name": "Tinker",
				"entries": [
					"You have proficiency with artisan's tools (tinker's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time.",
					"When you create a device, choose one of the following options:",
					{
						"type": "entries",
						"name": "Clockwork Toy",
						"entries": [
							"This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents."
						]
					},
					{
						"type": "entries",
						"name": "Fire Starter",
						"entries": [
							"The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action."
						]
					},
					{
						"type": "entries",
						"name": "Music Box",
						"entries": [
							"When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed."
						]
					}
				],
				"type": "entries"
			}
		]
	},
	{
		"race": "Human",
		"name": "Default",
		"ability": {
			"str": 1,
			"dex": 1,
			"con": 1,
			"int": 1,
			"wis": 1,
			"cha": 1
		}
	},
	{
		"race": "Human",
		"name": "Variant",
		"ability": {
			"choose": [
				{
					"from": [
						"str",
						"dex",
						"con",
						"int",
						"wis",
						"cha"
					],
					"count": 2
				}
			]
		},
		"entries": [
			{
				"name": "Skills",
				"entries": [
					"You gain proficiency in one skill of your choice."
				],
				"type": "entries"
			},
			{
				"name": "Feat",
				"entries": [
					"You gain one feat of your choice."
				],
				"type": "entries"
			}
		]
	},
	{
		"race": "Halfling",
		"name": "Lightfoot",
		"ability": {
			"cha": 1
		},
		"entries": [
			{
				"name": "Naturally Stealthy",
				"entries": [
					"You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."
				],
				"type": "entries"
			}
		]
	},
	{
		"race": "Halfling",
		"name": "Stout",
		"ability": {
			"con": 1
		},
		"entries": [
			{
				"name": "Stout Resilience",
				"entries": [
					"You have advantage on saving throws against poison, and you have resistance against poison damage."
				],
				"type": "entries"
			}
		]
	},
	{
		"race": "Tiefling",
		"name": "Default",
		"ability": {
			"cha": 2,
			"int": 1
		},
		"entries": [
			{
				"name": "Infernal Legacy",
				"entries": [
					"You know the {@spell thaumaturgy} cantrip. Once you reach 3rd level, you can cast the {@spell hellish rebuke} spell as a 2nd-level spell; you must finish a long rest in order to cast the spell again using this trait. Once you reach 5th level, you can also cast the {@spell darkness} spell; you must finish a long rest in order to cast the spell again using this trait. Charisma is your spellcasting ability for these spells."
				],
				"type": "entries"
			}
		]
	}
]